/**
 * Created by songyingchun on 2017/8/5.
 */
/**
 * Created by songyingchun on 2017/6/2 0002.
 */
const selectArea = [
    {
        "sub": [
            {
                "name": "东城"
            },
            {
                "name": "西城"
            },
            {
                "name": "崇文"
            },
            {
                "name": "宣武"
            },
            {
                "name": "朝阳"
            },
            {
                "name": "丰台"
            },
            {
                "name": "石景山"
            },
            {
                "name": "海淀"
            },
            {
                "name": "门头沟"
            },
            {
                "name": "房山"
            },
            {
                "name": "通州"
            },
            {
                "name": "顺义"
            },
            {
                "name": "昌平"
            },
            {
                "name": "大兴"
            },
            {
                "name": "怀柔"
            },
            {
                "name": "平谷"
            },
            {
                "name": "密云"
            },
            {
                "name": "延庆"
            }
        ],
        "name": "北京"
    },
    {
        "sub": [
            {
                "name": "和平"
            },
            {
                "name": "河东"
            },
            {
                "name": "河西"
            },
            {
                "name": "南开"
            },
            {
                "name": "河北"
            },
            {
                "name": "红桥"
            },
            {
                "name": "东丽"
            },
            {
                "name": "西青"
            },
            {
                "name": "津南"
            },
            {
                "name": "北辰"
            },
            {
                "name": "武清"
            },
            {
                "name": "宝坻"
            },
            {
                "name": "滨海新区"
            },
            {
                "name": "宁河"
            },
            {
                "name": "蓟州"
            },
            {
                "name": "静海"
            }
        ],
        "name": "天津"
    },
    {
        "sub": [
            {
                "name": "黄浦"
            },
            {
                "name": "徐汇"
            },
            {
                "name": "长宁"
            },
            {
                "name": "静安"
            },
            {
                "name": "普陀"
            },
            {
                "name": "虹口"
            },
            {
                "name": "杨浦"
            },
            {
                "name": "闵行"
            },
            {
                "name": "宝山"
            },
            {
                "name": "嘉定"
            },
            {
                "name": "浦东新区"
            },
            {
                "name": "金山"
            },
            {
                "name": "松江"
            },
            {
                "name": "青浦"
            },
            {
                "name": "奉贤"
            },
            {
                "name": "崇明"
            }
        ],
        "name": "上海"
    },
    {
        "sub": [
            {
                "name": "万州"
            },
            {
                "name": "涪陵"
            },
            {
                "name": "渝中"
            },
            {
                "name": "大渡口"
            },
            {
                "name": "江北"
            },
            {
                "name": "沙坪坝"
            },
            {
                "name": "九龙坡"
            },
            {
                "name": "南岸"
            },
            {
                "name": "北碚"
            },
            {
                "name": "綦江"
            },
            {
                "name": "大足"
            },
            {
                "name": "渝北"
            },
            {
                "name": "巴南"
            },
            {
                "name": "黔江"
            },
            {
                "name": "长寿"
            },
            {
                "name": "江津"
            },
            {
                "name": "合川"
            },
            {
                "name": "永川"
            },
            {
                "name": "南川"
            },
            {
                "name": "潼南"
            },
            {
                "name": "铜梁"
            },
            {
                "name": "荣昌"
            },
            {
                "name": "璧山"
            },
            {
                "name": "梁平"
            },
            {
                "name": "城口"
            },
            {
                "name": "丰都"
            },
            {
                "name": "垫江"
            },
            {
                "name": "武隆"
            },
            {
                "name": "忠县"
            },
            {
                "name": "开州"
            },
            {
                "name": "云阳"
            },
            {
                "name": "奉节"
            },
            {
                "name": "巫山"
            },
            {
                "name": "巫溪"
            },
            {
                "name": "石柱"
            },
            {
                "name": "秀山"
            },
            {
                "name": "酉阳"
            },
            {
                "name": "彭水"
            }
        ],
        "name": "重庆"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "长安"
                    },
                    {
                        "name": "桥西"
                    },
                    {
                        "name": "新华"
                    },
                    {
                        "name": "井陉矿"
                    },
                    {
                        "name": "裕华"
                    },
                    {
                        "name": "井陉"
                    },
                    {
                        "name": "正定"
                    },
                    {
                        "name": "栾城"
                    },
                    {
                        "name": "行唐"
                    },
                    {
                        "name": "灵寿"
                    },
                    {
                        "name": "高邑"
                    },
                    {
                        "name": "深泽"
                    },
                    {
                        "name": "赞皇"
                    },
                    {
                        "name": "无极"
                    },
                    {
                        "name": "平山"
                    },
                    {
                        "name": "元氏"
                    },
                    {
                        "name": "赵县"
                    },
                    {
                        "name": "辛集"
                    },
                    {
                        "name": "藁城"
                    },
                    {
                        "name": "晋州"
                    },
                    {
                        "name": "新乐"
                    },
                    {
                        "name": "鹿泉"
                    }
                ],
                "name": "石家庄"
            },
            {
                "sub": [
                    {
                        "name": "路南"
                    },
                    {
                        "name": "路北"
                    },
                    {
                        "name": "古冶"
                    },
                    {
                        "name": "开平"
                    },
                    {
                        "name": "丰南"
                    },
                    {
                        "name": "丰润"
                    },
                    {
                        "name": "滦县"
                    },
                    {
                        "name": "滦南"
                    },
                    {
                        "name": "乐亭"
                    },
                    {
                        "name": "迁西"
                    },
                    {
                        "name": "玉田"
                    },
                    {
                        "name": "唐海"
                    },
                    {
                        "name": "遵化"
                    },
                    {
                        "name": "迁安"
                    }
                ],
                "name": "唐山"
            },
            {
                "sub": [
                    {
                        "name": "海港"
                    },
                    {
                        "name": "山海关"
                    },
                    {
                        "name": "北戴河"
                    },
                    {
                        "name": "青龙"
                    },
                    {
                        "name": "昌黎"
                    },
                    {
                        "name": "抚宁"
                    },
                    {
                        "name": "卢龙"
                    }
                ],
                "name": "秦皇岛"
            },
            {
                "sub": [
                    {
                        "name": "邯山"
                    },
                    {
                        "name": "丛台"
                    },
                    {
                        "name": "复兴"
                    },
                    {
                        "name": "峰峰矿"
                    },
                    {
                        "name": "临漳"
                    },
                    {
                        "name": "成安"
                    },
                    {
                        "name": "大名"
                    },
                    {
                        "name": "涉县"
                    },
                    {
                        "name": "磁县"
                    },
                    {
                        "name": "肥乡"
                    },
                    {
                        "name": "永年"
                    },
                    {
                        "name": "邱县"
                    },
                    {
                        "name": "鸡泽"
                    },
                    {
                        "name": "广平"
                    },
                    {
                        "name": "馆陶"
                    },
                    {
                        "name": "魏县"
                    },
                    {
                        "name": "曲周"
                    },
                    {
                        "name": "武安"
                    }
                ],
                "name": "邯郸"
            },
            {
                "sub": [
                    {
                        "name": "桥东"
                    },
                    {
                        "name": "桥西"
                    },
                    {
                        "name": "邢台"
                    },
                    {
                        "name": "临城"
                    },
                    {
                        "name": "内丘"
                    },
                    {
                        "name": "柏乡"
                    },
                    {
                        "name": "隆尧"
                    },
                    {
                        "name": "任县"
                    },
                    {
                        "name": "南和"
                    },
                    {
                        "name": "宁晋"
                    },
                    {
                        "name": "巨鹿"
                    },
                    {
                        "name": "新河"
                    },
                    {
                        "name": "广宗"
                    },
                    {
                        "name": "平乡"
                    },
                    {
                        "name": "威县"
                    },
                    {
                        "name": "清河"
                    },
                    {
                        "name": "临西"
                    },
                    {
                        "name": "南宫"
                    },
                    {
                        "name": "沙河"
                    }
                ],
                "name": "邢台"
            },
            {
                "sub": [
                    {
                        "name": "竞秀"
                    },
                    {
                        "name": "莲池"
                    },
                    {
                        "name": "满城"
                    },
                    {
                        "name": "清苑"
                    },
                    {
                        "name": "涞水"
                    },
                    {
                        "name": "阜平"
                    },
                    {
                        "name": "徐水"
                    },
                    {
                        "name": "定兴"
                    },
                    {
                        "name": "唐县"
                    },
                    {
                        "name": "高阳"
                    },
                    {
                        "name": "容城"
                    },
                    {
                        "name": "涞源"
                    },
                    {
                        "name": "望都"
                    },
                    {
                        "name": "安新"
                    },
                    {
                        "name": "易县"
                    },
                    {
                        "name": "曲阳"
                    },
                    {
                        "name": "蠡县"
                    },
                    {
                        "name": "顺平"
                    },
                    {
                        "name": "博野"
                    },
                    {
                        "name": "雄县"
                    },
                    {
                        "name": "涿州"
                    },
                    {
                        "name": "定州"
                    },
                    {
                        "name": "安国"
                    },
                    {
                        "name": "高碑店"
                    }
                ],
                "name": "保定"
            },
            {
                "sub": [
                    {
                        "name": "桥东"
                    },
                    {
                        "name": "桥西"
                    },
                    {
                        "name": "宣化"
                    },
                    {
                        "name": "下花园"
                    },
                    {
                        "name": "张北"
                    },
                    {
                        "name": "康保"
                    },
                    {
                        "name": "沽源"
                    },
                    {
                        "name": "尚义"
                    },
                    {
                        "name": "蔚县"
                    },
                    {
                        "name": "阳原"
                    },
                    {
                        "name": "怀安"
                    },
                    {
                        "name": "万全"
                    },
                    {
                        "name": "怀来"
                    },
                    {
                        "name": "涿鹿"
                    },
                    {
                        "name": "赤城"
                    },
                    {
                        "name": "崇礼"
                    }
                ],
                "name": "张家口"
            },
            {
                "sub": [
                    {
                        "name": "双桥"
                    },
                    {
                        "name": "双滦"
                    },
                    {
                        "name": "鹰手营子"
                    },
                    {
                        "name": "承德"
                    },
                    {
                        "name": "兴隆"
                    },
                    {
                        "name": "平泉"
                    },
                    {
                        "name": "滦平"
                    },
                    {
                        "name": "隆化"
                    },
                    {
                        "name": "丰宁"
                    },
                    {
                        "name": "宽城"
                    },
                    {
                        "name": "围场"
                    }
                ],
                "name": "承德"
            },
            {
                "sub": [
                    {
                        "name": "新华"
                    },
                    {
                        "name": "运河"
                    },
                    {
                        "name": "沧县"
                    },
                    {
                        "name": "青县"
                    },
                    {
                        "name": "东光"
                    },
                    {
                        "name": "海兴"
                    },
                    {
                        "name": "盐山"
                    },
                    {
                        "name": "肃宁"
                    },
                    {
                        "name": "南皮"
                    },
                    {
                        "name": "吴桥"
                    },
                    {
                        "name": "献县"
                    },
                    {
                        "name": "孟村"
                    },
                    {
                        "name": "泊头"
                    },
                    {
                        "name": "任丘"
                    },
                    {
                        "name": "黄骅"
                    },
                    {
                        "name": "河间"
                    }
                ],
                "name": "沧州"
            },
            {
                "sub": [
                    {
                        "name": "安次"
                    },
                    {
                        "name": "广阳"
                    },
                    {
                        "name": "固安"
                    },
                    {
                        "name": "永清"
                    },
                    {
                        "name": "香河"
                    },
                    {
                        "name": "大城"
                    },
                    {
                        "name": "文安"
                    },
                    {
                        "name": "大厂"
                    },
                    {
                        "name": "霸州"
                    },
                    {
                        "name": "三河"
                    }
                ],
                "name": "廊坊"
            },
            {
                "sub": [
                    {
                        "name": "桃城"
                    },
                    {
                        "name": "枣强"
                    },
                    {
                        "name": "武邑"
                    },
                    {
                        "name": "武强"
                    },
                    {
                        "name": "饶阳"
                    },
                    {
                        "name": "安平"
                    },
                    {
                        "name": "故城"
                    },
                    {
                        "name": "景县"
                    },
                    {
                        "name": "阜城"
                    },
                    {
                        "name": "冀州"
                    },
                    {
                        "name": "深州"
                    }
                ],
                "name": "衡水"
            }
        ],
        "name": "河北"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "小店"
                    },
                    {
                        "name": "迎泽"
                    },
                    {
                        "name": "杏花岭"
                    },
                    {
                        "name": "尖草坪"
                    },
                    {
                        "name": "万柏林"
                    },
                    {
                        "name": "晋源"
                    },
                    {
                        "name": "清徐"
                    },
                    {
                        "name": "阳曲"
                    },
                    {
                        "name": "娄烦"
                    },
                    {
                        "name": "古交"
                    }
                ],
                "name": "太原"
            },
            {
                "sub": [
                    {
                        "name": "城区"
                    },
                    {
                        "name": "矿区"
                    },
                    {
                        "name": "南郊"
                    },
                    {
                        "name": "新荣"
                    },
                    {
                        "name": "阳高"
                    },
                    {
                        "name": "天镇"
                    },
                    {
                        "name": "广灵"
                    },
                    {
                        "name": "灵丘"
                    },
                    {
                        "name": "浑源"
                    },
                    {
                        "name": "左云"
                    },
                    {
                        "name": "大同"
                    }
                ],
                "name": "大同"
            },
            {
                "sub": [
                    {
                        "name": "城区"
                    },
                    {
                        "name": "矿区"
                    },
                    {
                        "name": "郊区"
                    },
                    {
                        "name": "平定"
                    },
                    {
                        "name": "盂县"
                    }
                ],
                "name": "阳泉"
            },
            {
                "sub": [
                    {
                        "name": "城区"
                    },
                    {
                        "name": "郊区"
                    },
                    {
                        "name": "长治"
                    },
                    {
                        "name": "襄垣"
                    },
                    {
                        "name": "屯留"
                    },
                    {
                        "name": "平顺"
                    },
                    {
                        "name": "黎城"
                    },
                    {
                        "name": "壶关"
                    },
                    {
                        "name": "长子"
                    },
                    {
                        "name": "武乡"
                    },
                    {
                        "name": "沁县"
                    },
                    {
                        "name": "沁源"
                    },
                    {
                        "name": "潞城"
                    }
                ],
                "name": "长治"
            },
            {
                "sub": [
                    {
                        "name": "城区"
                    },
                    {
                        "name": "沁水"
                    },
                    {
                        "name": "阳城"
                    },
                    {
                        "name": "陵川"
                    },
                    {
                        "name": "泽州"
                    },
                    {
                        "name": "高平"
                    }
                ],
                "name": "晋城"
            },
            {
                "sub": [
                    {
                        "name": "朔城"
                    },
                    {
                        "name": "平鲁"
                    },
                    {
                        "name": "山阴"
                    },
                    {
                        "name": "应县"
                    },
                    {
                        "name": "右玉"
                    },
                    {
                        "name": "怀仁"
                    }
                ],
                "name": "朔州"
            },
            {
                "sub": [
                    {
                        "name": "榆次"
                    },
                    {
                        "name": "榆社"
                    },
                    {
                        "name": "左权"
                    },
                    {
                        "name": "和顺"
                    },
                    {
                        "name": "昔阳"
                    },
                    {
                        "name": "寿阳"
                    },
                    {
                        "name": "太谷"
                    },
                    {
                        "name": "祁县"
                    },
                    {
                        "name": "平遥"
                    },
                    {
                        "name": "灵石"
                    },
                    {
                        "name": "介休"
                    }
                ],
                "name": "晋中"
            },
            {
                "sub": [
                    {
                        "name": "盐湖"
                    },
                    {
                        "name": "临猗"
                    },
                    {
                        "name": "万荣"
                    },
                    {
                        "name": "闻喜"
                    },
                    {
                        "name": "稷山"
                    },
                    {
                        "name": "新绛"
                    },
                    {
                        "name": "绛县"
                    },
                    {
                        "name": "垣曲"
                    },
                    {
                        "name": "夏县"
                    },
                    {
                        "name": "平陆"
                    },
                    {
                        "name": "芮城"
                    },
                    {
                        "name": "永济"
                    },
                    {
                        "name": "河津"
                    }
                ],
                "name": "运城"
            },
            {
                "sub": [
                    {
                        "name": "忻府"
                    },
                    {
                        "name": "定襄"
                    },
                    {
                        "name": "五台"
                    },
                    {
                        "name": "代县"
                    },
                    {
                        "name": "繁峙"
                    },
                    {
                        "name": "宁武"
                    },
                    {
                        "name": "静乐"
                    },
                    {
                        "name": "神池"
                    },
                    {
                        "name": "五寨"
                    },
                    {
                        "name": "岢岚"
                    },
                    {
                        "name": "河曲"
                    },
                    {
                        "name": "保德"
                    },
                    {
                        "name": "偏关"
                    },
                    {
                        "name": "原平"
                    }
                ],
                "name": "忻州"
            },
            {
                "sub": [
                    {
                        "name": "尧都"
                    },
                    {
                        "name": "曲沃"
                    },
                    {
                        "name": "翼城"
                    },
                    {
                        "name": "襄汾"
                    },
                    {
                        "name": "洪洞"
                    },
                    {
                        "name": "古县"
                    },
                    {
                        "name": "安泽"
                    },
                    {
                        "name": "浮山"
                    },
                    {
                        "name": "吉县"
                    },
                    {
                        "name": "乡宁"
                    },
                    {
                        "name": "大宁"
                    },
                    {
                        "name": "隰县"
                    },
                    {
                        "name": "永和"
                    },
                    {
                        "name": "蒲县"
                    },
                    {
                        "name": "汾西"
                    },
                    {
                        "name": "侯马"
                    },
                    {
                        "name": "霍州"
                    }
                ],
                "name": "临汾"
            },
            {
                "sub": [
                    {
                        "name": "离石"
                    },
                    {
                        "name": "文水"
                    },
                    {
                        "name": "交城"
                    },
                    {
                        "name": "兴县"
                    },
                    {
                        "name": "临县"
                    },
                    {
                        "name": "柳林"
                    },
                    {
                        "name": "石楼"
                    },
                    {
                        "name": "岚县"
                    },
                    {
                        "name": "方山"
                    },
                    {
                        "name": "中阳"
                    },
                    {
                        "name": "交口"
                    },
                    {
                        "name": "孝义"
                    },
                    {
                        "name": "汾阳"
                    }
                ],
                "name": "吕梁"
            }
        ],
        "name": "山西"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "新城"
                    },
                    {
                        "name": "回民"
                    },
                    {
                        "name": "玉泉"
                    },
                    {
                        "name": "赛罕"
                    },
                    {
                        "name": "土默特左"
                    },
                    {
                        "name": "托克托"
                    },
                    {
                        "name": "和林格尔"
                    },
                    {
                        "name": "清水河"
                    },
                    {
                        "name": "武川"
                    }
                ],
                "name": "呼和浩特"
            },
            {
                "sub": [
                    {
                        "name": "东河"
                    },
                    {
                        "name": "昆都仑"
                    },
                    {
                        "name": "青山"
                    },
                    {
                        "name": "石拐"
                    },
                    {
                        "name": "白云"
                    },
                    {
                        "name": "九原"
                    },
                    {
                        "name": "土默特右"
                    },
                    {
                        "name": "固阳"
                    },
                    {
                        "name": "达尔罕茂明安"
                    }
                ],
                "name": "包头"
            },
            {
                "sub": [
                    {
                        "name": "海勃湾"
                    },
                    {
                        "name": "海南"
                    },
                    {
                        "name": "乌达"
                    }
                ],
                "name": "乌海"
            },
            {
                "sub": [
                    {
                        "name": "红山"
                    },
                    {
                        "name": "元宝山"
                    },
                    {
                        "name": "松山"
                    },
                    {
                        "name": "阿鲁科尔沁"
                    },
                    {
                        "name": "巴林左"
                    },
                    {
                        "name": "巴林右"
                    },
                    {
                        "name": "林西"
                    },
                    {
                        "name": "克什克腾"
                    },
                    {
                        "name": "翁牛特"
                    },
                    {
                        "name": "喀喇沁"
                    },
                    {
                        "name": "宁城"
                    },
                    {
                        "name": "敖汉"
                    }
                ],
                "name": "赤峰"
            },
            {
                "sub": [
                    {
                        "name": "科尔沁"
                    },
                    {
                        "name": "科尔沁左翼中"
                    },
                    {
                        "name": "科尔沁左翼后"
                    },
                    {
                        "name": "开鲁"
                    },
                    {
                        "name": "库伦"
                    },
                    {
                        "name": "奈曼"
                    },
                    {
                        "name": "扎鲁特"
                    },
                    {
                        "name": "霍林郭勒"
                    }
                ],
                "name": "通辽"
            },
            {
                "sub": [
                    {
                        "name": "东胜"
                    },
                    {
                        "name": "达拉特"
                    },
                    {
                        "name": "准格尔"
                    },
                    {
                        "name": "鄂托克前"
                    },
                    {
                        "name": "鄂托克"
                    },
                    {
                        "name": "杭锦"
                    },
                    {
                        "name": "乌审"
                    },
                    {
                        "name": "伊金霍洛"
                    },
                    {
                        "name": "巴什"
                    }
                ],
                "name": "鄂尔多斯"
            },
            {
                "sub": [
                    {
                        "name": "海拉尔"
                    },
                    {
                        "name": "阿荣"
                    },
                    {
                        "name": "莫力达瓦"
                    },
                    {
                        "name": "鄂伦春"
                    },
                    {
                        "name": "鄂温克族"
                    },
                    {
                        "name": "陈巴尔虎"
                    },
                    {
                        "name": "新巴尔虎左"
                    },
                    {
                        "name": "新巴尔虎右"
                    },
                    {
                        "name": "满洲里"
                    },
                    {
                        "name": "牙克石"
                    },
                    {
                        "name": "扎兰屯"
                    },
                    {
                        "name": "额尔古纳"
                    },
                    {
                        "name": "根河"
                    }
                ],
                "name": "呼伦贝尔"
            },
            {
                "sub": [
                    {
                        "name": "临河"
                    },
                    {
                        "name": "五原"
                    },
                    {
                        "name": "磴口"
                    },
                    {
                        "name": "乌拉特前"
                    },
                    {
                        "name": "乌拉特中"
                    },
                    {
                        "name": "乌拉特后"
                    },
                    {
                        "name": "杭锦后"
                    }
                ],
                "name": "巴彦淖尔"
            },
            {
                "sub": [
                    {
                        "name": "集宁"
                    },
                    {
                        "name": "卓资"
                    },
                    {
                        "name": "化德"
                    },
                    {
                        "name": "商都"
                    },
                    {
                        "name": "兴和"
                    },
                    {
                        "name": "凉城"
                    },
                    {
                        "name": "察哈尔右翼前"
                    },
                    {
                        "name": "察哈尔右翼中"
                    },
                    {
                        "name": "察哈尔右翼后"
                    },
                    {
                        "name": "四子王"
                    },
                    {
                        "name": "丰镇"
                    }
                ],
                "name": "乌兰察布"
            },
            {
                "sub": [
                    {
                        "name": "乌兰浩特"
                    },
                    {
                        "name": "阿尔山"
                    },
                    {
                        "name": "科尔沁右翼前"
                    },
                    {
                        "name": "科尔沁右翼中"
                    },
                    {
                        "name": "扎赉特"
                    },
                    {
                        "name": "突泉"
                    }
                ],
                "name": "兴安"
            },
            {
                "sub": [
                    {
                        "name": "二连浩特"
                    },
                    {
                        "name": "锡林浩特"
                    },
                    {
                        "name": "阿巴嘎"
                    },
                    {
                        "name": "苏尼特左"
                    },
                    {
                        "name": "苏尼特右"
                    },
                    {
                        "name": "东乌珠穆沁"
                    },
                    {
                        "name": "西乌珠穆沁"
                    },
                    {
                        "name": "太仆寺"
                    },
                    {
                        "name": "镶黄"
                    },
                    {
                        "name": "正镶白"
                    },
                    {
                        "name": "正蓝"
                    },
                    {
                        "name": "多伦"
                    }
                ],
                "name": "锡林郭勒"
            },
            {
                "sub": [
                    {
                        "name": "阿拉善左"
                    },
                    {
                        "name": "阿拉善右"
                    },
                    {
                        "name": "额济纳"
                    }
                ],
                "name": "阿拉善"
            }
        ],
        "name": "内蒙古"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "和平"
                    },
                    {
                        "name": "沈河"
                    },
                    {
                        "name": "大东"
                    },
                    {
                        "name": "皇姑"
                    },
                    {
                        "name": "铁西"
                    },
                    {
                        "name": "苏家屯"
                    },
                    {
                        "name": "浑南"
                    },
                    {
                        "name": "沈北新区"
                    },
                    {
                        "name": "于洪"
                    },
                    {
                        "name": "辽中"
                    },
                    {
                        "name": "康平"
                    },
                    {
                        "name": "法库"
                    },
                    {
                        "name": "新民"
                    }
                ],
                "name": "沈阳"
            },
            {
                "sub": [
                    {
                        "name": "中山"
                    },
                    {
                        "name": "西岗"
                    },
                    {
                        "name": "沙河口"
                    },
                    {
                        "name": "甘井子"
                    },
                    {
                        "name": "旅顺口"
                    },
                    {
                        "name": "金州"
                    },
                    {
                        "name": "长海"
                    },
                    {
                        "name": "瓦房店"
                    },
                    {
                        "name": "普兰店"
                    },
                    {
                        "name": "庄河"
                    }
                ],
                "name": "大连"
            },
            {
                "sub": [
                    {
                        "name": "铁东"
                    },
                    {
                        "name": "铁西"
                    },
                    {
                        "name": "立山"
                    },
                    {
                        "name": "千山"
                    },
                    {
                        "name": "台安"
                    },
                    {
                        "name": "岫岩"
                    },
                    {
                        "name": "海城"
                    }
                ],
                "name": "鞍山"
            },
            {
                "sub": [
                    {
                        "name": "新抚"
                    },
                    {
                        "name": "东洲"
                    },
                    {
                        "name": "望花"
                    },
                    {
                        "name": "顺城"
                    },
                    {
                        "name": "抚顺"
                    },
                    {
                        "name": "新宾"
                    },
                    {
                        "name": "清原"
                    }
                ],
                "name": "抚顺"
            },
            {
                "sub": [
                    {
                        "name": "平山"
                    },
                    {
                        "name": "溪湖"
                    },
                    {
                        "name": "明山"
                    },
                    {
                        "name": "南芬"
                    },
                    {
                        "name": "本溪"
                    },
                    {
                        "name": "桓仁"
                    }
                ],
                "name": "本溪"
            },
            {
                "sub": [
                    {
                        "name": "元宝"
                    },
                    {
                        "name": "振兴"
                    },
                    {
                        "name": "振安"
                    },
                    {
                        "name": "宽甸"
                    },
                    {
                        "name": "东港"
                    },
                    {
                        "name": "凤城"
                    }
                ],
                "name": "丹东"
            },
            {
                "sub": [
                    {
                        "name": "古塔"
                    },
                    {
                        "name": "凌河"
                    },
                    {
                        "name": "太和"
                    },
                    {
                        "name": "黑山"
                    },
                    {
                        "name": "义县"
                    },
                    {
                        "name": "凌海"
                    },
                    {
                        "name": "北镇"
                    }
                ],
                "name": "锦州"
            },
            {
                "sub": [
                    {
                        "name": "站前"
                    },
                    {
                        "name": "西市"
                    },
                    {
                        "name": "鲅鱼圈"
                    },
                    {
                        "name": "老边"
                    },
                    {
                        "name": "盖州"
                    },
                    {
                        "name": "大石桥"
                    }
                ],
                "name": "营口"
            },
            {
                "sub": [
                    {
                        "name": "海州"
                    },
                    {
                        "name": "新邱"
                    },
                    {
                        "name": "太平"
                    },
                    {
                        "name": "清河门"
                    },
                    {
                        "name": "细河"
                    },
                    {
                        "name": "阜新"
                    },
                    {
                        "name": "彰武"
                    }
                ],
                "name": "阜新"
            },
            {
                "sub": [
                    {
                        "name": "白塔"
                    },
                    {
                        "name": "文圣"
                    },
                    {
                        "name": "宏伟"
                    },
                    {
                        "name": "弓长岭"
                    },
                    {
                        "name": "辽阳"
                    },
                    {
                        "name": "灯塔"
                    },
                    {
                        "name": "太子河"
                    }
                ],
                "name": "辽阳"
            },
            {
                "sub": [
                    {
                        "name": "双台子"
                    },
                    {
                        "name": "兴隆台"
                    },
                    {
                        "name": "大洼"
                    },
                    {
                        "name": "盘山"
                    }
                ],
                "name": "盘锦"
            },
            {
                "sub": [
                    {
                        "name": "银州"
                    },
                    {
                        "name": "清河"
                    },
                    {
                        "name": "铁岭"
                    },
                    {
                        "name": "西丰"
                    },
                    {
                        "name": "昌图"
                    },
                    {
                        "name": "调兵山"
                    },
                    {
                        "name": "开原"
                    }
                ],
                "name": "铁岭"
            },
            {
                "sub": [
                    {
                        "name": "双塔"
                    },
                    {
                        "name": "龙城"
                    },
                    {
                        "name": "朝阳"
                    },
                    {
                        "name": "建平"
                    },
                    {
                        "name": "喀喇沁左翼"
                    },
                    {
                        "name": "北票"
                    },
                    {
                        "name": "凌源"
                    }
                ],
                "name": "朝阳"
            },
            {
                "sub": [
                    {
                        "name": "连山"
                    },
                    {
                        "name": "龙港"
                    },
                    {
                        "name": "南票"
                    },
                    {
                        "name": "绥中"
                    },
                    {
                        "name": "建昌"
                    },
                    {
                        "name": "兴城"
                    }
                ],
                "name": "葫芦岛"
            }
        ],
        "name": "辽宁"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "南关"
                    },
                    {
                        "name": "宽城"
                    },
                    {
                        "name": "朝阳"
                    },
                    {
                        "name": "二道"
                    },
                    {
                        "name": "绿园"
                    },
                    {
                        "name": "双阳"
                    },
                    {
                        "name": "农安"
                    },
                    {
                        "name": "九台"
                    },
                    {
                        "name": "榆树"
                    },
                    {
                        "name": "德惠"
                    }
                ],
                "name": "长春"
            },
            {
                "sub": [
                    {
                        "name": "昌邑"
                    },
                    {
                        "name": "龙潭"
                    },
                    {
                        "name": "船营"
                    },
                    {
                        "name": "丰满"
                    },
                    {
                        "name": "永吉"
                    },
                    {
                        "name": "桦甸"
                    },
                    {
                        "name": "蛟河"
                    },
                    {
                        "name": "舒兰"
                    },
                    {
                        "name": "磐石"
                    }
                ],
                "name": "吉林"
            },
            {
                "sub": [
                    {
                        "name": "铁西"
                    },
                    {
                        "name": "铁东"
                    },
                    {
                        "name": "梨树"
                    },
                    {
                        "name": "伊通"
                    },
                    {
                        "name": "公主岭"
                    },
                    {
                        "name": "双辽"
                    }
                ],
                "name": "四平"
            },
            {
                "sub": [
                    {
                        "name": "龙山"
                    },
                    {
                        "name": "西安"
                    },
                    {
                        "name": "东丰"
                    },
                    {
                        "name": "东辽"
                    }
                ],
                "name": "辽源"
            },
            {
                "sub": [
                    {
                        "name": "东昌"
                    },
                    {
                        "name": "二道江"
                    },
                    {
                        "name": "通化"
                    },
                    {
                        "name": "辉南"
                    },
                    {
                        "name": "柳河"
                    },
                    {
                        "name": "梅河口"
                    },
                    {
                        "name": "集安"
                    }
                ],
                "name": "通化"
            },
            {
                "sub": [
                    {
                        "name": "浑江"
                    },
                    {
                        "name": "江源"
                    },
                    {
                        "name": "抚松"
                    },
                    {
                        "name": "靖宇"
                    },
                    {
                        "name": "长白"
                    },
                    {
                        "name": "临江"
                    }
                ],
                "name": "白山"
            },
            {
                "sub": [
                    {
                        "name": "宁江"
                    },
                    {
                        "name": "前郭尔罗斯"
                    },
                    {
                        "name": "长岭"
                    },
                    {
                        "name": "乾安"
                    },
                    {
                        "name": "扶余"
                    }
                ],
                "name": "松原"
            },
            {
                "sub": [
                    {
                        "name": "洮北"
                    },
                    {
                        "name": "镇赉"
                    },
                    {
                        "name": "洮南"
                    },
                    {
                        "name": "大安"
                    },
                    {
                        "name": "通榆"
                    }
                ],
                "name": "白城"
            },
            {
                "sub": [
                    {
                        "name": "延吉"
                    },
                    {
                        "name": "图们"
                    },
                    {
                        "name": "敦化"
                    },
                    {
                        "name": "珲春"
                    },
                    {
                        "name": "龙井"
                    },
                    {
                        "name": "和龙"
                    },
                    {
                        "name": "汪清"
                    },
                    {
                        "name": "安图"
                    }
                ],
                "name": "延边"
            }
        ],
        "name": "吉林"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "道里"
                    },
                    {
                        "name": "南岗"
                    },
                    {
                        "name": "道外"
                    },
                    {
                        "name": "平房"
                    },
                    {
                        "name": "松北"
                    },
                    {
                        "name": "香坊"
                    },
                    {
                        "name": "呼兰"
                    },
                    {
                        "name": "阿城"
                    },
                    {
                        "name": "依兰"
                    },
                    {
                        "name": "方正"
                    },
                    {
                        "name": "宾县"
                    },
                    {
                        "name": "巴彦"
                    },
                    {
                        "name": "木兰"
                    },
                    {
                        "name": "通河"
                    },
                    {
                        "name": "延寿"
                    },
                    {
                        "name": "双城"
                    },
                    {
                        "name": "尚志"
                    },
                    {
                        "name": "五常"
                    }
                ],
                "name": "哈尔滨"
            },
            {
                "sub": [
                    {
                        "name": "龙沙"
                    },
                    {
                        "name": "建华"
                    },
                    {
                        "name": "铁锋"
                    },
                    {
                        "name": "昂昂溪"
                    },
                    {
                        "name": "富拉尔基"
                    },
                    {
                        "name": "碾子山"
                    },
                    {
                        "name": "梅里斯"
                    },
                    {
                        "name": "龙江"
                    },
                    {
                        "name": "依安"
                    },
                    {
                        "name": "泰来"
                    },
                    {
                        "name": "甘南"
                    },
                    {
                        "name": "富裕"
                    },
                    {
                        "name": "克山"
                    },
                    {
                        "name": "克东"
                    },
                    {
                        "name": "拜泉"
                    },
                    {
                        "name": "讷河"
                    }
                ],
                "name": "齐齐哈尔"
            },
            {
                "sub": [
                    {
                        "name": "鸡冠"
                    },
                    {
                        "name": "恒山"
                    },
                    {
                        "name": "滴道"
                    },
                    {
                        "name": "梨树"
                    },
                    {
                        "name": "城子河"
                    },
                    {
                        "name": "麻山"
                    },
                    {
                        "name": "鸡东"
                    },
                    {
                        "name": "虎林"
                    },
                    {
                        "name": "密山"
                    }
                ],
                "name": "鸡西"
            },
            {
                "sub": [
                    {
                        "name": "向阳"
                    },
                    {
                        "name": "工农"
                    },
                    {
                        "name": "南山"
                    },
                    {
                        "name": "兴安"
                    },
                    {
                        "name": "东山"
                    },
                    {
                        "name": "兴山"
                    },
                    {
                        "name": "萝北"
                    },
                    {
                        "name": "绥滨"
                    }
                ],
                "name": "鹤岗"
            },
            {
                "sub": [
                    {
                        "name": "尖山"
                    },
                    {
                        "name": "岭东"
                    },
                    {
                        "name": "四方台"
                    },
                    {
                        "name": "宝山"
                    },
                    {
                        "name": "集贤"
                    },
                    {
                        "name": "友谊"
                    },
                    {
                        "name": "宝清"
                    },
                    {
                        "name": "饶河"
                    }
                ],
                "name": "双鸭山"
            },
            {
                "sub": [
                    {
                        "name": "萨尔图"
                    },
                    {
                        "name": "龙凤"
                    },
                    {
                        "name": "让胡路"
                    },
                    {
                        "name": "红岗"
                    },
                    {
                        "name": "大同"
                    },
                    {
                        "name": "肇州"
                    },
                    {
                        "name": "肇源"
                    },
                    {
                        "name": "林甸"
                    },
                    {
                        "name": "杜尔伯特"
                    }
                ],
                "name": "大庆"
            },
            {
                "sub": [
                    {
                        "name": "伊春"
                    },
                    {
                        "name": "南岔"
                    },
                    {
                        "name": "友好"
                    },
                    {
                        "name": "西林"
                    },
                    {
                        "name": "翠峦"
                    },
                    {
                        "name": "新青"
                    },
                    {
                        "name": "美溪"
                    },
                    {
                        "name": "金山屯"
                    },
                    {
                        "name": "五营"
                    },
                    {
                        "name": "乌马河"
                    },
                    {
                        "name": "汤旺河"
                    },
                    {
                        "name": "带岭"
                    },
                    {
                        "name": "乌伊岭"
                    },
                    {
                        "name": "红星"
                    },
                    {
                        "name": "上甘岭"
                    },
                    {
                        "name": "嘉荫"
                    },
                    {
                        "name": "铁力"
                    }
                ],
                "name": "伊春"
            },
            {
                "sub": [
                    {
                        "name": "向阳"
                    },
                    {
                        "name": "前进"
                    },
                    {
                        "name": "东风"
                    },
                    {
                        "name": "郊区"
                    },
                    {
                        "name": "桦南"
                    },
                    {
                        "name": "桦川"
                    },
                    {
                        "name": "汤原"
                    },
                    {
                        "name": "抚远"
                    },
                    {
                        "name": "同江"
                    },
                    {
                        "name": "富锦"
                    }
                ],
                "name": "佳木斯"
            },
            {
                "sub": [
                    {
                        "name": "新兴"
                    },
                    {
                        "name": "桃山"
                    },
                    {
                        "name": "茄子河"
                    },
                    {
                        "name": "勃利"
                    }
                ],
                "name": "七台河"
            },
            {
                "sub": [
                    {
                        "name": "东安"
                    },
                    {
                        "name": "阳明"
                    },
                    {
                        "name": "爱民"
                    },
                    {
                        "name": "西安"
                    },
                    {
                        "name": "东宁"
                    },
                    {
                        "name": "林口"
                    },
                    {
                        "name": "绥芬河"
                    },
                    {
                        "name": "海林"
                    },
                    {
                        "name": "宁安"
                    },
                    {
                        "name": "穆棱"
                    }
                ],
                "name": "牡丹江"
            },
            {
                "sub": [
                    {
                        "name": "爱辉"
                    },
                    {
                        "name": "嫩江"
                    },
                    {
                        "name": "逊克"
                    },
                    {
                        "name": "孙吴"
                    },
                    {
                        "name": "北安"
                    },
                    {
                        "name": "五大连池"
                    }
                ],
                "name": "黑河"
            },
            {
                "sub": [
                    {
                        "name": "北林"
                    },
                    {
                        "name": "望奎"
                    },
                    {
                        "name": "兰西"
                    },
                    {
                        "name": "青冈"
                    },
                    {
                        "name": "庆安"
                    },
                    {
                        "name": "明水"
                    },
                    {
                        "name": "绥棱"
                    },
                    {
                        "name": "安达"
                    },
                    {
                        "name": "肇东"
                    },
                    {
                        "name": "海伦"
                    }
                ],
                "name": "绥化"
            },
            {
                "sub": [
                    {
                        "name": "加格达奇"
                    },
                    {
                        "name": "松岭"
                    },
                    {
                        "name": "新林"
                    },
                    {
                        "name": "呼中"
                    },
                    {
                        "name": "呼玛"
                    },
                    {
                        "name": "塔河"
                    },
                    {
                        "name": "漠河"
                    }
                ],
                "name": "大兴安岭"
            }
        ],
        "name": "黑龙江"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "玄武"
                    },
                    {
                        "name": "秦淮"
                    },
                    {
                        "name": "建邺"
                    },
                    {
                        "name": "鼓楼"
                    },
                    {
                        "name": "浦口"
                    },
                    {
                        "name": "栖霞"
                    },
                    {
                        "name": "雨花台"
                    },
                    {
                        "name": "江宁"
                    },
                    {
                        "name": "六合"
                    },
                    {
                        "name": "溧水"
                    },
                    {
                        "name": "高淳"
                    }
                ],
                "name": "南京"
            },
            {
                "sub": [
                    {
                        "name": "梁溪"
                    },
                    {
                        "name": "新吴"
                    },
                    {
                        "name": "锡山"
                    },
                    {
                        "name": "惠山"
                    },
                    {
                        "name": "滨湖"
                    },
                    {
                        "name": "江阴"
                    },
                    {
                        "name": "宜兴"
                    }
                ],
                "name": "无锡"
            },
            {
                "sub": [
                    {
                        "name": "鼓楼"
                    },
                    {
                        "name": "云龙"
                    },
                    {
                        "name": "贾汪"
                    },
                    {
                        "name": "泉山"
                    },
                    {
                        "name": "铜山"
                    },
                    {
                        "name": "丰县"
                    },
                    {
                        "name": "沛县"
                    },
                    {
                        "name": "睢宁"
                    },
                    {
                        "name": "新沂"
                    },
                    {
                        "name": "邳州"
                    }
                ],
                "name": "徐州"
            },
            {
                "sub": [
                    {
                        "name": "天宁"
                    },
                    {
                        "name": "钟楼"
                    },
                    {
                        "name": "新北"
                    },
                    {
                        "name": "武进"
                    },
                    {
                        "name": "溧阳"
                    },
                    {
                        "name": "金坛"
                    }
                ],
                "name": "常州"
            },
            {
                "sub": [
                    {
                        "name": "虎丘"
                    },
                    {
                        "name": "吴中"
                    },
                    {
                        "name": "相城"
                    },
                    {
                        "name": "姑苏"
                    },
                    {
                        "name": "吴江"
                    },
                    {
                        "name": "常熟"
                    },
                    {
                        "name": "张家港"
                    },
                    {
                        "name": "昆山"
                    },
                    {
                        "name": "太仓"
                    }
                ],
                "name": "苏州"
            },
            {
                "sub": [
                    {
                        "name": "崇川"
                    },
                    {
                        "name": "港闸"
                    },
                    {
                        "name": "通州"
                    },
                    {
                        "name": "海安"
                    },
                    {
                        "name": "如东"
                    },
                    {
                        "name": "启东"
                    },
                    {
                        "name": "如皋"
                    },
                    {
                        "name": "海门"
                    }
                ],
                "name": "南通"
            },
            {
                "sub": [
                    {
                        "name": "连云"
                    },
                    {
                        "name": "海州"
                    },
                    {
                        "name": "赣榆"
                    },
                    {
                        "name": "东海"
                    },
                    {
                        "name": "灌云"
                    },
                    {
                        "name": "灌南"
                    }
                ],
                "name": "连云港"
            },
            {
                "sub": [
                    {
                        "name": "清河"
                    },
                    {
                        "name": "淮安"
                    },
                    {
                        "name": "淮阴"
                    },
                    {
                        "name": "清浦"
                    },
                    {
                        "name": "涟水"
                    },
                    {
                        "name": "洪泽"
                    },
                    {
                        "name": "盱眙"
                    },
                    {
                        "name": "金湖"
                    }
                ],
                "name": "淮安"
            },
            {
                "sub": [
                    {
                        "name": "亭湖"
                    },
                    {
                        "name": "盐都"
                    },
                    {
                        "name": "响水"
                    },
                    {
                        "name": "滨海"
                    },
                    {
                        "name": "阜宁"
                    },
                    {
                        "name": "射阳"
                    },
                    {
                        "name": "建湖"
                    },
                    {
                        "name": "东台"
                    },
                    {
                        "name": "大丰"
                    }
                ],
                "name": "盐城"
            },
            {
                "sub": [
                    {
                        "name": "广陵"
                    },
                    {
                        "name": "邗江"
                    },
                    {
                        "name": "江都"
                    },
                    {
                        "name": "宝应"
                    },
                    {
                        "name": "仪征"
                    },
                    {
                        "name": "高邮"
                    }
                ],
                "name": "扬州"
            },
            {
                "sub": [
                    {
                        "name": "京口"
                    },
                    {
                        "name": "润州"
                    },
                    {
                        "name": "丹徒"
                    },
                    {
                        "name": "丹阳"
                    },
                    {
                        "name": "扬中"
                    },
                    {
                        "name": "句容"
                    }
                ],
                "name": "镇江"
            },
            {
                "sub": [
                    {
                        "name": "海陵"
                    },
                    {
                        "name": "高港"
                    },
                    {
                        "name": "兴化"
                    },
                    {
                        "name": "靖江"
                    },
                    {
                        "name": "泰兴"
                    },
                    {
                        "name": "姜堰"
                    }
                ],
                "name": "泰州"
            },
            {
                "sub": [
                    {
                        "name": "宿城"
                    },
                    {
                        "name": "宿豫"
                    },
                    {
                        "name": "沭阳"
                    },
                    {
                        "name": "泗阳"
                    },
                    {
                        "name": "泗洪"
                    }
                ],
                "name": "宿迁"
            }
        ],
        "name": "江苏"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "上城"
                    },
                    {
                        "name": "下城"
                    },
                    {
                        "name": "江干"
                    },
                    {
                        "name": "拱墅"
                    },
                    {
                        "name": "西湖"
                    },
                    {
                        "name": "滨江"
                    },
                    {
                        "name": "萧山"
                    },
                    {
                        "name": "余杭"
                    },
                    {
                        "name": "桐庐"
                    },
                    {
                        "name": "淳安"
                    },
                    {
                        "name": "建德"
                    },
                    {
                        "name": "富阳"
                    },
                    {
                        "name": "临安"
                    }
                ],
                "name": "杭州"
            },
            {
                "sub": [
                    {
                        "name": "海曙"
                    },
                    {
                        "name": "江北"
                    },
                    {
                        "name": "北仑"
                    },
                    {
                        "name": "镇海"
                    },
                    {
                        "name": "鄞州"
                    },
                    {
                        "name": "象山"
                    },
                    {
                        "name": "宁海"
                    },
                    {
                        "name": "余姚"
                    },
                    {
                        "name": "慈溪"
                    },
                    {
                        "name": "奉化"
                    }
                ],
                "name": "宁波"
            },
            {
                "sub": [
                    {
                        "name": "鹿城"
                    },
                    {
                        "name": "龙湾"
                    },
                    {
                        "name": "瓯海"
                    },
                    {
                        "name": "洞头"
                    },
                    {
                        "name": "永嘉"
                    },
                    {
                        "name": "平阳"
                    },
                    {
                        "name": "苍南"
                    },
                    {
                        "name": "文成"
                    },
                    {
                        "name": "泰顺"
                    },
                    {
                        "name": "瑞安"
                    },
                    {
                        "name": "乐清"
                    }
                ],
                "name": "温州"
            },
            {
                "sub": [
                    {
                        "name": "南湖"
                    },
                    {
                        "name": "秀洲"
                    },
                    {
                        "name": "嘉善"
                    },
                    {
                        "name": "海盐"
                    },
                    {
                        "name": "海宁"
                    },
                    {
                        "name": "平湖"
                    },
                    {
                        "name": "桐乡"
                    }
                ],
                "name": "嘉兴"
            },
            {
                "sub": [
                    {
                        "name": "吴兴"
                    },
                    {
                        "name": "南浔"
                    },
                    {
                        "name": "德清"
                    },
                    {
                        "name": "长兴"
                    },
                    {
                        "name": "安吉"
                    }
                ],
                "name": "湖州"
            },
            {
                "sub": [
                    {
                        "name": "越城"
                    },
                    {
                        "name": "柯桥"
                    },
                    {
                        "name": "新昌"
                    },
                    {
                        "name": "诸暨"
                    },
                    {
                        "name": "上虞"
                    },
                    {
                        "name": "嵊州"
                    }
                ],
                "name": "绍兴"
            },
            {
                "sub": [
                    {
                        "name": "婺城"
                    },
                    {
                        "name": "金东"
                    },
                    {
                        "name": "武义"
                    },
                    {
                        "name": "浦江"
                    },
                    {
                        "name": "磐安"
                    },
                    {
                        "name": "兰溪"
                    },
                    {
                        "name": "义乌"
                    },
                    {
                        "name": "东阳"
                    },
                    {
                        "name": "永康"
                    }
                ],
                "name": "金华"
            },
            {
                "sub": [
                    {
                        "name": "柯城"
                    },
                    {
                        "name": "衢江"
                    },
                    {
                        "name": "常山"
                    },
                    {
                        "name": "开化"
                    },
                    {
                        "name": "龙游"
                    },
                    {
                        "name": "江山"
                    }
                ],
                "name": "衢州"
            },
            {
                "sub": [
                    {
                        "name": "定海"
                    },
                    {
                        "name": "普陀"
                    },
                    {
                        "name": "岱山"
                    },
                    {
                        "name": "嵊泗"
                    }
                ],
                "name": "舟山"
            },
            {
                "sub": [
                    {
                        "name": "椒江"
                    },
                    {
                        "name": "黄岩"
                    },
                    {
                        "name": "路桥"
                    },
                    {
                        "name": "玉环"
                    },
                    {
                        "name": "三门"
                    },
                    {
                        "name": "天台"
                    },
                    {
                        "name": "仙居"
                    },
                    {
                        "name": "温岭"
                    },
                    {
                        "name": "临海"
                    }
                ],
                "name": "台州"
            },
            {
                "sub": [
                    {
                        "name": "莲都"
                    },
                    {
                        "name": "青田"
                    },
                    {
                        "name": "缙云"
                    },
                    {
                        "name": "遂昌"
                    },
                    {
                        "name": "松阳"
                    },
                    {
                        "name": "云和"
                    },
                    {
                        "name": "庆元"
                    },
                    {
                        "name": "景宁"
                    },
                    {
                        "name": "龙泉"
                    }
                ],
                "name": "丽水"
            }
        ],
        "name": "浙江"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "瑶海"
                    },
                    {
                        "name": "庐阳"
                    },
                    {
                        "name": "蜀山"
                    },
                    {
                        "name": "包河"
                    },
                    {
                        "name": "长丰"
                    },
                    {
                        "name": "肥东"
                    },
                    {
                        "name": "肥西"
                    },
                    {
                        "name": "庐江"
                    },
                    {
                        "name": "巢湖"
                    }
                ],
                "name": "合肥"
            },
            {
                "sub": [
                    {
                        "name": "镜湖"
                    },
                    {
                        "name": "弋江"
                    },
                    {
                        "name": "鸠江"
                    },
                    {
                        "name": "三山"
                    },
                    {
                        "name": "芜湖"
                    },
                    {
                        "name": "繁昌"
                    },
                    {
                        "name": "南陵"
                    },
                    {
                        "name": "无为"
                    }
                ],
                "name": "芜湖"
            },
            {
                "sub": [
                    {
                        "name": "龙子湖"
                    },
                    {
                        "name": "蚌山"
                    },
                    {
                        "name": "禹会"
                    },
                    {
                        "name": "淮上"
                    },
                    {
                        "name": "怀远"
                    },
                    {
                        "name": "五河"
                    },
                    {
                        "name": "固镇"
                    }
                ],
                "name": "蚌埠"
            },
            {
                "sub": [
                    {
                        "name": "大通"
                    },
                    {
                        "name": "田家庵"
                    },
                    {
                        "name": "谢家集"
                    },
                    {
                        "name": "八公山"
                    },
                    {
                        "name": "潘集"
                    },
                    {
                        "name": "凤台"
                    },
                    {
                        "name": "寿县"
                    }
                ],
                "name": "淮南"
            },
            {
                "sub": [
                    {
                        "name": "花山"
                    },
                    {
                        "name": "雨山"
                    },
                    {
                        "name": "博望"
                    },
                    {
                        "name": "当涂"
                    },
                    {
                        "name": "含山"
                    },
                    {
                        "name": "和县"
                    }
                ],
                "name": "马鞍山"
            },
            {
                "sub": [
                    {
                        "name": "杜集"
                    },
                    {
                        "name": "相山"
                    },
                    {
                        "name": "烈山"
                    },
                    {
                        "name": "濉溪"
                    }
                ],
                "name": "淮北"
            },
            {
                "sub": [
                    {
                        "name": "铜官山"
                    },
                    {
                        "name": "郊区"
                    },
                    {
                        "name": "义安"
                    },
                    {
                        "name": "枞阳"
                    }
                ],
                "name": "铜陵"
            },
            {
                "sub": [
                    {
                        "name": "迎江"
                    },
                    {
                        "name": "大观"
                    },
                    {
                        "name": "宜秀"
                    },
                    {
                        "name": "怀宁"
                    },
                    {
                        "name": "潜山"
                    },
                    {
                        "name": "太湖"
                    },
                    {
                        "name": "宿松"
                    },
                    {
                        "name": "望江"
                    },
                    {
                        "name": "岳西"
                    },
                    {
                        "name": "桐城"
                    }
                ],
                "name": "安庆"
            },
            {
                "sub": [
                    {
                        "name": "屯溪"
                    },
                    {
                        "name": "黄山"
                    },
                    {
                        "name": "徽州"
                    },
                    {
                        "name": "歙县"
                    },
                    {
                        "name": "休宁"
                    },
                    {
                        "name": "黟县"
                    },
                    {
                        "name": "祁门"
                    }
                ],
                "name": "黄山"
            },
            {
                "sub": [
                    {
                        "name": "琅玡"
                    },
                    {
                        "name": "南谯"
                    },
                    {
                        "name": "来安"
                    },
                    {
                        "name": "全椒"
                    },
                    {
                        "name": "定远"
                    },
                    {
                        "name": "凤阳"
                    },
                    {
                        "name": "天长"
                    },
                    {
                        "name": "明光"
                    }
                ],
                "name": "滁州"
            },
            {
                "sub": [
                    {
                        "name": "颍州"
                    },
                    {
                        "name": "颍东"
                    },
                    {
                        "name": "颍泉"
                    },
                    {
                        "name": "临泉"
                    },
                    {
                        "name": "太和"
                    },
                    {
                        "name": "阜南"
                    },
                    {
                        "name": "颖上"
                    },
                    {
                        "name": "界首"
                    }
                ],
                "name": "阜阳"
            },
            {
                "sub": [
                    {
                        "name": "埇桥"
                    },
                    {
                        "name": "砀山"
                    },
                    {
                        "name": "萧县"
                    },
                    {
                        "name": "灵璧"
                    },
                    {
                        "name": "泗县"
                    }
                ],
                "name": "宿州"
            },
            {
                "sub": [
                    {
                        "name": "金安"
                    },
                    {
                        "name": "裕安"
                    },
                    {
                        "name": "霍邱"
                    },
                    {
                        "name": "舒城"
                    },
                    {
                        "name": "金寨"
                    },
                    {
                        "name": "霍山"
                    },
                    {
                        "name": "叶集"
                    }
                ],
                "name": "六安"
            },
            {
                "sub": [
                    {
                        "name": "谯城"
                    },
                    {
                        "name": "涡阳"
                    },
                    {
                        "name": "蒙城"
                    },
                    {
                        "name": "利辛"
                    }
                ],
                "name": "亳州"
            },
            {
                "sub": [
                    {
                        "name": "贵池"
                    },
                    {
                        "name": "东至"
                    },
                    {
                        "name": "石台"
                    },
                    {
                        "name": "青阳"
                    }
                ],
                "name": "池州"
            },
            {
                "sub": [
                    {
                        "name": "宣州"
                    },
                    {
                        "name": "郎溪"
                    },
                    {
                        "name": "广德"
                    },
                    {
                        "name": "泾县"
                    },
                    {
                        "name": "绩溪"
                    },
                    {
                        "name": "旌德"
                    },
                    {
                        "name": "宁国"
                    }
                ],
                "name": "宣城"
            }
        ],
        "name": "安徽"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "鼓楼"
                    },
                    {
                        "name": "台江"
                    },
                    {
                        "name": "仓山"
                    },
                    {
                        "name": "马尾"
                    },
                    {
                        "name": "晋安"
                    },
                    {
                        "name": "闽侯"
                    },
                    {
                        "name": "连江"
                    },
                    {
                        "name": "罗源"
                    },
                    {
                        "name": "闽清"
                    },
                    {
                        "name": "永泰"
                    },
                    {
                        "name": "平潭"
                    },
                    {
                        "name": "福清"
                    },
                    {
                        "name": "长乐"
                    }
                ],
                "name": "福州"
            },
            {
                "sub": [
                    {
                        "name": "思明"
                    },
                    {
                        "name": "海沧"
                    },
                    {
                        "name": "湖里"
                    },
                    {
                        "name": "集美"
                    },
                    {
                        "name": "同安"
                    },
                    {
                        "name": "翔安"
                    }
                ],
                "name": "厦门"
            },
            {
                "sub": [
                    {
                        "name": "城厢"
                    },
                    {
                        "name": "涵江"
                    },
                    {
                        "name": "荔城"
                    },
                    {
                        "name": "秀屿"
                    },
                    {
                        "name": "仙游"
                    }
                ],
                "name": "莆田"
            },
            {
                "sub": [
                    {
                        "name": "梅列"
                    },
                    {
                        "name": "三元"
                    },
                    {
                        "name": "明溪"
                    },
                    {
                        "name": "清流"
                    },
                    {
                        "name": "宁化"
                    },
                    {
                        "name": "大田"
                    },
                    {
                        "name": "尤溪"
                    },
                    {
                        "name": "沙县"
                    },
                    {
                        "name": "将乐"
                    },
                    {
                        "name": "泰宁"
                    },
                    {
                        "name": "建宁"
                    },
                    {
                        "name": "永安"
                    }
                ],
                "name": "三明"
            },
            {
                "sub": [
                    {
                        "name": "鲤城"
                    },
                    {
                        "name": "丰泽"
                    },
                    {
                        "name": "洛江"
                    },
                    {
                        "name": "泉港"
                    },
                    {
                        "name": "惠安"
                    },
                    {
                        "name": "安溪"
                    },
                    {
                        "name": "永春"
                    },
                    {
                        "name": "德化"
                    },
                    {
                        "name": "金门"
                    },
                    {
                        "name": "石狮"
                    },
                    {
                        "name": "晋江"
                    },
                    {
                        "name": "南安"
                    }
                ],
                "name": "泉州"
            },
            {
                "sub": [
                    {
                        "name": "芗城"
                    },
                    {
                        "name": "龙文"
                    },
                    {
                        "name": "云霄"
                    },
                    {
                        "name": "漳浦"
                    },
                    {
                        "name": "诏安"
                    },
                    {
                        "name": "长泰"
                    },
                    {
                        "name": "东山"
                    },
                    {
                        "name": "南靖"
                    },
                    {
                        "name": "平和"
                    },
                    {
                        "name": "华安"
                    },
                    {
                        "name": "龙海"
                    }
                ],
                "name": "漳州"
            },
            {
                "sub": [
                    {
                        "name": "延平"
                    },
                    {
                        "name": "顺昌"
                    },
                    {
                        "name": "浦城"
                    },
                    {
                        "name": "光泽"
                    },
                    {
                        "name": "松溪"
                    },
                    {
                        "name": "政和"
                    },
                    {
                        "name": "邵武"
                    },
                    {
                        "name": "武夷山"
                    },
                    {
                        "name": "建瓯"
                    },
                    {
                        "name": "建阳"
                    }
                ],
                "name": "南平"
            },
            {
                "sub": [
                    {
                        "name": "新罗"
                    },
                    {
                        "name": "长汀"
                    },
                    {
                        "name": "永定"
                    },
                    {
                        "name": "上杭"
                    },
                    {
                        "name": "武平"
                    },
                    {
                        "name": "连城"
                    },
                    {
                        "name": "漳平"
                    }
                ],
                "name": "龙岩"
            },
            {
                "sub": [
                    {
                        "name": "蕉城"
                    },
                    {
                        "name": "霞浦"
                    },
                    {
                        "name": "古田"
                    },
                    {
                        "name": "屏南"
                    },
                    {
                        "name": "寿宁"
                    },
                    {
                        "name": "周宁"
                    },
                    {
                        "name": "柘荣"
                    },
                    {
                        "name": "福安"
                    },
                    {
                        "name": "福鼎"
                    }
                ],
                "name": "宁德"
            }
        ],
        "name": "福建"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "东湖"
                    },
                    {
                        "name": "西湖"
                    },
                    {
                        "name": "青云谱"
                    },
                    {
                        "name": "湾里"
                    },
                    {
                        "name": "青山湖"
                    },
                    {
                        "name": "南昌"
                    },
                    {
                        "name": "新建"
                    },
                    {
                        "name": "安义"
                    },
                    {
                        "name": "进贤"
                    }
                ],
                "name": "南昌"
            },
            {
                "sub": [
                    {
                        "name": "昌江"
                    },
                    {
                        "name": "珠山"
                    },
                    {
                        "name": "浮梁"
                    },
                    {
                        "name": "乐平"
                    }
                ],
                "name": "景德镇"
            },
            {
                "sub": [
                    {
                        "name": "安源"
                    },
                    {
                        "name": "湘东"
                    },
                    {
                        "name": "莲花"
                    },
                    {
                        "name": "上栗"
                    },
                    {
                        "name": "芦溪"
                    }
                ],
                "name": "萍乡"
            },
            {
                "sub": [
                    {
                        "name": "濂溪"
                    },
                    {
                        "name": "浔阳"
                    },
                    {
                        "name": "九江"
                    },
                    {
                        "name": "武宁"
                    },
                    {
                        "name": "修水"
                    },
                    {
                        "name": "永修"
                    },
                    {
                        "name": "德安"
                    },
                    {
                        "name": "庐山"
                    },
                    {
                        "name": "都昌"
                    },
                    {
                        "name": "湖口"
                    },
                    {
                        "name": "彭泽"
                    },
                    {
                        "name": "瑞昌"
                    },
                    {
                        "name": "共青城"
                    }
                ],
                "name": "九江"
            },
            {
                "sub": [
                    {
                        "name": "渝水"
                    },
                    {
                        "name": "分宜"
                    }
                ],
                "name": "新余"
            },
            {
                "sub": [
                    {
                        "name": "月湖"
                    },
                    {
                        "name": "余江"
                    },
                    {
                        "name": "贵溪"
                    }
                ],
                "name": "鹰潭"
            },
            {
                "sub": [
                    {
                        "name": "章贡"
                    },
                    {
                        "name": "赣县"
                    },
                    {
                        "name": "信丰"
                    },
                    {
                        "name": "大余"
                    },
                    {
                        "name": "上犹"
                    },
                    {
                        "name": "崇义"
                    },
                    {
                        "name": "安远"
                    },
                    {
                        "name": "龙南"
                    },
                    {
                        "name": "定南"
                    },
                    {
                        "name": "全南"
                    },
                    {
                        "name": "宁都"
                    },
                    {
                        "name": "于都"
                    },
                    {
                        "name": "兴国"
                    },
                    {
                        "name": "会昌"
                    },
                    {
                        "name": "寻乌"
                    },
                    {
                        "name": "石城"
                    },
                    {
                        "name": "瑞金"
                    },
                    {
                        "name": "南康"
                    }
                ],
                "name": "赣州"
            },
            {
                "sub": [
                    {
                        "name": "吉州"
                    },
                    {
                        "name": "青原"
                    },
                    {
                        "name": "吉安"
                    },
                    {
                        "name": "吉水"
                    },
                    {
                        "name": "峡江"
                    },
                    {
                        "name": "新干"
                    },
                    {
                        "name": "永丰"
                    },
                    {
                        "name": "泰和"
                    },
                    {
                        "name": "遂川"
                    },
                    {
                        "name": "万安"
                    },
                    {
                        "name": "安福"
                    },
                    {
                        "name": "永新"
                    },
                    {
                        "name": "井冈山"
                    }
                ],
                "name": "吉安"
            },
            {
                "sub": [
                    {
                        "name": "袁州"
                    },
                    {
                        "name": "奉新"
                    },
                    {
                        "name": "万载"
                    },
                    {
                        "name": "上高"
                    },
                    {
                        "name": "宜丰"
                    },
                    {
                        "name": "靖安"
                    },
                    {
                        "name": "铜鼓"
                    },
                    {
                        "name": "丰城"
                    },
                    {
                        "name": "樟树"
                    },
                    {
                        "name": "高安"
                    }
                ],
                "name": "宜春"
            },
            {
                "sub": [
                    {
                        "name": "临川"
                    },
                    {
                        "name": "南城"
                    },
                    {
                        "name": "黎川"
                    },
                    {
                        "name": "南丰"
                    },
                    {
                        "name": "崇仁"
                    },
                    {
                        "name": "乐安"
                    },
                    {
                        "name": "宜黄"
                    },
                    {
                        "name": "金溪"
                    },
                    {
                        "name": "资溪"
                    },
                    {
                        "name": "东乡"
                    },
                    {
                        "name": "广昌"
                    }
                ],
                "name": "抚州"
            },
            {
                "sub": [
                    {
                        "name": "信州"
                    },
                    {
                        "name": "上饶"
                    },
                    {
                        "name": "广丰"
                    },
                    {
                        "name": "玉山"
                    },
                    {
                        "name": "铅山"
                    },
                    {
                        "name": "横峰"
                    },
                    {
                        "name": "弋阳"
                    },
                    {
                        "name": "余干"
                    },
                    {
                        "name": "鄱阳"
                    },
                    {
                        "name": "万年"
                    },
                    {
                        "name": "婺源"
                    },
                    {
                        "name": "德兴"
                    }
                ],
                "name": "上饶"
            }
        ],
        "name": "江西"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "历下"
                    },
                    {
                        "name": "市中"
                    },
                    {
                        "name": "槐荫"
                    },
                    {
                        "name": "天桥"
                    },
                    {
                        "name": "历城"
                    },
                    {
                        "name": "长清"
                    },
                    {
                        "name": "平阴"
                    },
                    {
                        "name": "济阳"
                    },
                    {
                        "name": "商河"
                    },
                    {
                        "name": "章丘"
                    }
                ],
                "name": "济南"
            },
            {
                "sub": [
                    {
                        "name": "市南"
                    },
                    {
                        "name": "市北"
                    },
                    {
                        "name": "黄岛"
                    },
                    {
                        "name": "崂山"
                    },
                    {
                        "name": "李沧"
                    },
                    {
                        "name": "城阳"
                    },
                    {
                        "name": "胶州"
                    },
                    {
                        "name": "即墨"
                    },
                    {
                        "name": "平度"
                    },
                    {
                        "name": "莱西"
                    }
                ],
                "name": "青岛"
            },
            {
                "sub": [
                    {
                        "name": "淄川"
                    },
                    {
                        "name": "张店"
                    },
                    {
                        "name": "博山"
                    },
                    {
                        "name": "临淄"
                    },
                    {
                        "name": "周村"
                    },
                    {
                        "name": "桓台"
                    },
                    {
                        "name": "高青"
                    },
                    {
                        "name": "沂源"
                    }
                ],
                "name": "淄博"
            },
            {
                "sub": [
                    {
                        "name": "市中"
                    },
                    {
                        "name": "薛城"
                    },
                    {
                        "name": "峄城"
                    },
                    {
                        "name": "台儿庄"
                    },
                    {
                        "name": "山亭"
                    },
                    {
                        "name": "滕州"
                    }
                ],
                "name": "枣庄"
            },
            {
                "sub": [
                    {
                        "name": "东营"
                    },
                    {
                        "name": "河口"
                    },
                    {
                        "name": "垦利"
                    },
                    {
                        "name": "利津"
                    },
                    {
                        "name": "广饶"
                    }
                ],
                "name": "东营"
            },
            {
                "sub": [
                    {
                        "name": "芝罘"
                    },
                    {
                        "name": "福山"
                    },
                    {
                        "name": "牟平"
                    },
                    {
                        "name": "莱山"
                    },
                    {
                        "name": "长岛"
                    },
                    {
                        "name": "龙口"
                    },
                    {
                        "name": "莱阳"
                    },
                    {
                        "name": "莱州"
                    },
                    {
                        "name": "蓬莱"
                    },
                    {
                        "name": "招远"
                    },
                    {
                        "name": "栖霞"
                    },
                    {
                        "name": "海阳"
                    }
                ],
                "name": "烟台"
            },
            {
                "sub": [
                    {
                        "name": "潍城"
                    },
                    {
                        "name": "寒亭"
                    },
                    {
                        "name": "坊子"
                    },
                    {
                        "name": "奎文"
                    },
                    {
                        "name": "临朐"
                    },
                    {
                        "name": "昌乐"
                    },
                    {
                        "name": "青州"
                    },
                    {
                        "name": "诸城"
                    },
                    {
                        "name": "寿光"
                    },
                    {
                        "name": "安丘"
                    },
                    {
                        "name": "高密"
                    },
                    {
                        "name": "昌邑"
                    }
                ],
                "name": "潍坊"
            },
            {
                "sub": [
                    {
                        "name": "任城"
                    },
                    {
                        "name": "微山"
                    },
                    {
                        "name": "鱼台"
                    },
                    {
                        "name": "金乡"
                    },
                    {
                        "name": "嘉祥"
                    },
                    {
                        "name": "汶上"
                    },
                    {
                        "name": "泗水"
                    },
                    {
                        "name": "梁山"
                    },
                    {
                        "name": "曲阜"
                    },
                    {
                        "name": "兖州"
                    },
                    {
                        "name": "邹城"
                    }
                ],
                "name": "济宁"
            },
            {
                "sub": [
                    {
                        "name": "泰山"
                    },
                    {
                        "name": "岱岳"
                    },
                    {
                        "name": "宁阳"
                    },
                    {
                        "name": "东平"
                    },
                    {
                        "name": "新泰"
                    },
                    {
                        "name": "肥城"
                    }
                ],
                "name": "泰安"
            },
            {
                "sub": [
                    {
                        "name": "环翠"
                    },
                    {
                        "name": "文登"
                    },
                    {
                        "name": "荣成"
                    },
                    {
                        "name": "乳山"
                    }
                ],
                "name": "威海"
            },
            {
                "sub": [
                    {
                        "name": "东港"
                    },
                    {
                        "name": "岚山"
                    },
                    {
                        "name": "五莲"
                    },
                    {
                        "name": "莒县"
                    }
                ],
                "name": "日照"
            },
            {
                "sub": [
                    {
                        "name": "莱城"
                    },
                    {
                        "name": "钢城"
                    }
                ],
                "name": "莱芜"
            },
            {
                "sub": [
                    {
                        "name": "兰山"
                    },
                    {
                        "name": "罗庄"
                    },
                    {
                        "name": "河东"
                    },
                    {
                        "name": "沂南"
                    },
                    {
                        "name": "郯城"
                    },
                    {
                        "name": "沂水"
                    },
                    {
                        "name": "兰陵"
                    },
                    {
                        "name": "费县"
                    },
                    {
                        "name": "平邑"
                    },
                    {
                        "name": "莒南"
                    },
                    {
                        "name": "蒙阴"
                    },
                    {
                        "name": "临沭"
                    }
                ],
                "name": "临沂"
            },
            {
                "sub": [
                    {
                        "name": "德城"
                    },
                    {
                        "name": "陵城"
                    },
                    {
                        "name": "宁津"
                    },
                    {
                        "name": "庆云"
                    },
                    {
                        "name": "临邑"
                    },
                    {
                        "name": "齐河"
                    },
                    {
                        "name": "平原"
                    },
                    {
                        "name": "夏津"
                    },
                    {
                        "name": "武城"
                    },
                    {
                        "name": "乐陵"
                    },
                    {
                        "name": "禹城"
                    }
                ],
                "name": "德州"
            },
            {
                "sub": [
                    {
                        "name": "东昌府"
                    },
                    {
                        "name": "阳谷"
                    },
                    {
                        "name": "莘县"
                    },
                    {
                        "name": "茌平"
                    },
                    {
                        "name": "东阿"
                    },
                    {
                        "name": "冠县"
                    },
                    {
                        "name": "高唐"
                    },
                    {
                        "name": "临清"
                    }
                ],
                "name": "聊城"
            },
            {
                "sub": [
                    {
                        "name": "滨城"
                    },
                    {
                        "name": "惠民"
                    },
                    {
                        "name": "阳信"
                    },
                    {
                        "name": "无棣"
                    },
                    {
                        "name": "沾化"
                    },
                    {
                        "name": "博兴"
                    },
                    {
                        "name": "邹平"
                    }
                ],
                "name": "滨州"
            },
            {
                "sub": [
                    {
                        "name": "牡丹"
                    },
                    {
                        "name": "曹县"
                    },
                    {
                        "name": "单县"
                    },
                    {
                        "name": "成武"
                    },
                    {
                        "name": "巨野"
                    },
                    {
                        "name": "郓城"
                    },
                    {
                        "name": "鄄城"
                    },
                    {
                        "name": "定陶"
                    },
                    {
                        "name": "东明"
                    }
                ],
                "name": "菏泽"
            }
        ],
        "name": "山东"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "中原"
                    },
                    {
                        "name": "二七"
                    },
                    {
                        "name": "管城"
                    },
                    {
                        "name": "金水"
                    },
                    {
                        "name": "上街"
                    },
                    {
                        "name": "惠济"
                    },
                    {
                        "name": "中牟"
                    },
                    {
                        "name": "巩义"
                    },
                    {
                        "name": "荥阳"
                    },
                    {
                        "name": "新密"
                    },
                    {
                        "name": "新郑"
                    },
                    {
                        "name": "登封"
                    }
                ],
                "name": "郑州"
            },
            {
                "sub": [
                    {
                        "name": "龙亭"
                    },
                    {
                        "name": "顺河"
                    },
                    {
                        "name": "鼓楼"
                    },
                    {
                        "name": "禹王台"
                    },
                    {
                        "name": "杞县"
                    },
                    {
                        "name": "通许"
                    },
                    {
                        "name": "尉氏"
                    },
                    {
                        "name": "祥符"
                    },
                    {
                        "name": "兰考"
                    }
                ],
                "name": "开封"
            },
            {
                "sub": [
                    {
                        "name": "老城"
                    },
                    {
                        "name": "西工"
                    },
                    {
                        "name": "瀍河"
                    },
                    {
                        "name": "涧西"
                    },
                    {
                        "name": "吉利"
                    },
                    {
                        "name": "洛龙"
                    },
                    {
                        "name": "孟津"
                    },
                    {
                        "name": "新安"
                    },
                    {
                        "name": "栾川"
                    },
                    {
                        "name": "嵩县"
                    },
                    {
                        "name": "汝阳"
                    },
                    {
                        "name": "宜阳"
                    },
                    {
                        "name": "洛宁"
                    },
                    {
                        "name": "伊川"
                    },
                    {
                        "name": "偃师"
                    }
                ],
                "name": "洛阳"
            },
            {
                "sub": [
                    {
                        "name": "新华"
                    },
                    {
                        "name": "卫东"
                    },
                    {
                        "name": "石龙"
                    },
                    {
                        "name": "湛河"
                    },
                    {
                        "name": "宝丰"
                    },
                    {
                        "name": "叶县"
                    },
                    {
                        "name": "鲁山"
                    },
                    {
                        "name": "郏县"
                    },
                    {
                        "name": "舞钢"
                    },
                    {
                        "name": "汝州"
                    }
                ],
                "name": "平顶山"
            },
            {
                "sub": [
                    {
                        "name": "文峰"
                    },
                    {
                        "name": "北关"
                    },
                    {
                        "name": "殷都"
                    },
                    {
                        "name": "龙安"
                    },
                    {
                        "name": "安阳"
                    },
                    {
                        "name": "汤阴"
                    },
                    {
                        "name": "滑县"
                    },
                    {
                        "name": "内黄"
                    },
                    {
                        "name": "林州"
                    }
                ],
                "name": "安阳"
            },
            {
                "sub": [
                    {
                        "name": "鹤山"
                    },
                    {
                        "name": "山城"
                    },
                    {
                        "name": "淇滨"
                    },
                    {
                        "name": "浚县"
                    },
                    {
                        "name": "淇县"
                    }
                ],
                "name": "鹤壁"
            },
            {
                "sub": [
                    {
                        "name": "红旗"
                    },
                    {
                        "name": "卫滨"
                    },
                    {
                        "name": "凤泉"
                    },
                    {
                        "name": "牧野"
                    },
                    {
                        "name": "新乡"
                    },
                    {
                        "name": "获嘉"
                    },
                    {
                        "name": "原阳"
                    },
                    {
                        "name": "延津"
                    },
                    {
                        "name": "封丘"
                    },
                    {
                        "name": "长垣"
                    },
                    {
                        "name": "卫辉"
                    },
                    {
                        "name": "辉县"
                    }
                ],
                "name": "新乡"
            },
            {
                "sub": [
                    {
                        "name": "解放"
                    },
                    {
                        "name": "中站"
                    },
                    {
                        "name": "马村"
                    },
                    {
                        "name": "山阳"
                    },
                    {
                        "name": "修武"
                    },
                    {
                        "name": "博爱"
                    },
                    {
                        "name": "武陟"
                    },
                    {
                        "name": "温县"
                    },
                    {
                        "name": "沁阳"
                    },
                    {
                        "name": "孟州"
                    }
                ],
                "name": "焦作"
            },
            {
                "sub": [
                    {
                        "name": "华龙"
                    },
                    {
                        "name": "清丰"
                    },
                    {
                        "name": "南乐"
                    },
                    {
                        "name": "范县"
                    },
                    {
                        "name": "台前"
                    },
                    {
                        "name": "濮阳"
                    }
                ],
                "name": "濮阳"
            },
            {
                "sub": [
                    {
                        "name": "魏都"
                    },
                    {
                        "name": "建安"
                    },
                    {
                        "name": "鄢陵"
                    },
                    {
                        "name": "襄城"
                    },
                    {
                        "name": "禹州"
                    },
                    {
                        "name": "长葛"
                    }
                ],
                "name": "许昌"
            },
            {
                "sub": [
                    {
                        "name": "源汇"
                    },
                    {
                        "name": "郾城"
                    },
                    {
                        "name": "召陵"
                    },
                    {
                        "name": "舞阳"
                    },
                    {
                        "name": "临颍"
                    }
                ],
                "name": "漯河"
            },
            {
                "sub": [
                    {
                        "name": "湖滨"
                    },
                    {
                        "name": "渑池"
                    },
                    {
                        "name": "陕州"
                    },
                    {
                        "name": "卢氏"
                    },
                    {
                        "name": "义马"
                    },
                    {
                        "name": "灵宝"
                    }
                ],
                "name": "三门峡"
            },
            {
                "sub": [
                    {
                        "name": "宛城"
                    },
                    {
                        "name": "卧龙"
                    },
                    {
                        "name": "南召"
                    },
                    {
                        "name": "方城"
                    },
                    {
                        "name": "西峡"
                    },
                    {
                        "name": "镇平"
                    },
                    {
                        "name": "内乡"
                    },
                    {
                        "name": "淅川"
                    },
                    {
                        "name": "社旗"
                    },
                    {
                        "name": "唐河"
                    },
                    {
                        "name": "新野"
                    },
                    {
                        "name": "桐柏"
                    },
                    {
                        "name": "邓州"
                    }
                ],
                "name": "南阳"
            },
            {
                "sub": [
                    {
                        "name": "粱园"
                    },
                    {
                        "name": "睢阳"
                    },
                    {
                        "name": "民权"
                    },
                    {
                        "name": "睢县"
                    },
                    {
                        "name": "宁陵"
                    },
                    {
                        "name": "柘城"
                    },
                    {
                        "name": "虞城"
                    },
                    {
                        "name": "夏邑"
                    },
                    {
                        "name": "永城"
                    }
                ],
                "name": "商丘"
            },
            {
                "sub": [
                    {
                        "name": "浉河"
                    },
                    {
                        "name": "平桥"
                    },
                    {
                        "name": "罗山"
                    },
                    {
                        "name": "光山"
                    },
                    {
                        "name": "新县"
                    },
                    {
                        "name": "商城"
                    },
                    {
                        "name": "固始"
                    },
                    {
                        "name": "潢川"
                    },
                    {
                        "name": "淮滨"
                    },
                    {
                        "name": "息县"
                    }
                ],
                "name": "信阳"
            },
            {
                "sub": [
                    {
                        "name": "川汇"
                    },
                    {
                        "name": "扶沟"
                    },
                    {
                        "name": "西华"
                    },
                    {
                        "name": "商水"
                    },
                    {
                        "name": "沈丘"
                    },
                    {
                        "name": "郸城"
                    },
                    {
                        "name": "淮阳"
                    },
                    {
                        "name": "太康"
                    },
                    {
                        "name": "鹿邑"
                    },
                    {
                        "name": "项城"
                    }
                ],
                "name": "周口"
            },
            {
                "sub": [
                    {
                        "name": "驿城"
                    },
                    {
                        "name": "西平"
                    },
                    {
                        "name": "上蔡"
                    },
                    {
                        "name": "平舆"
                    },
                    {
                        "name": "正阳"
                    },
                    {
                        "name": "确山"
                    },
                    {
                        "name": "泌阳"
                    },
                    {
                        "name": "汝南"
                    },
                    {
                        "name": "遂平"
                    },
                    {
                        "name": "新蔡"
                    }
                ],
                "name": "驻马店"
            },
            {
                "name": "济源"
            }
        ],
        "name": "河南"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "江岸"
                    },
                    {
                        "name": "江汉"
                    },
                    {
                        "name": "硚口"
                    },
                    {
                        "name": "汉阳"
                    },
                    {
                        "name": "武昌"
                    },
                    {
                        "name": "青山"
                    },
                    {
                        "name": "洪山"
                    },
                    {
                        "name": "东西湖"
                    },
                    {
                        "name": "汉南"
                    },
                    {
                        "name": "蔡甸"
                    },
                    {
                        "name": "江夏"
                    },
                    {
                        "name": "黄陂"
                    },
                    {
                        "name": "新洲"
                    }
                ],
                "name": "武汉"
            },
            {
                "sub": [
                    {
                        "name": "黄石港"
                    },
                    {
                        "name": "西塞山"
                    },
                    {
                        "name": "下陆"
                    },
                    {
                        "name": "铁山"
                    },
                    {
                        "name": "阳新"
                    },
                    {
                        "name": "大冶"
                    }
                ],
                "name": "黄石"
            },
            {
                "sub": [
                    {
                        "name": "茅箭"
                    },
                    {
                        "name": "张湾"
                    },
                    {
                        "name": "郧阳"
                    },
                    {
                        "name": "郧西"
                    },
                    {
                        "name": "竹山"
                    },
                    {
                        "name": "竹溪"
                    },
                    {
                        "name": "房县"
                    },
                    {
                        "name": "丹江口"
                    }
                ],
                "name": "十堰"
            },
            {
                "sub": [
                    {
                        "name": "西陵"
                    },
                    {
                        "name": "伍家岗"
                    },
                    {
                        "name": "点军"
                    },
                    {
                        "name": "虢亭"
                    },
                    {
                        "name": "夷陵"
                    },
                    {
                        "name": "远安"
                    },
                    {
                        "name": "兴山"
                    },
                    {
                        "name": "秭归"
                    },
                    {
                        "name": "长阳"
                    },
                    {
                        "name": "五峰"
                    },
                    {
                        "name": "宜都"
                    },
                    {
                        "name": "当阳"
                    },
                    {
                        "name": "枝江"
                    }
                ],
                "name": "宜昌"
            },
            {
                "sub": [
                    {
                        "name": "襄城"
                    },
                    {
                        "name": "樊城"
                    },
                    {
                        "name": "襄州"
                    },
                    {
                        "name": "南漳"
                    },
                    {
                        "name": "谷城"
                    },
                    {
                        "name": "保康"
                    },
                    {
                        "name": "老河口"
                    },
                    {
                        "name": "枣阳"
                    },
                    {
                        "name": "宜城"
                    }
                ],
                "name": "襄阳"
            },
            {
                "sub": [
                    {
                        "name": "粱子湖"
                    },
                    {
                        "name": "华容"
                    },
                    {
                        "name": "鄂城"
                    }
                ],
                "name": "鄂州"
            },
            {
                "sub": [
                    {
                        "name": "东宝"
                    },
                    {
                        "name": "掇刀"
                    },
                    {
                        "name": "京山"
                    },
                    {
                        "name": "沙洋"
                    },
                    {
                        "name": "钟祥"
                    }
                ],
                "name": "荆门"
            },
            {
                "sub": [
                    {
                        "name": "孝南"
                    },
                    {
                        "name": "大悟"
                    },
                    {
                        "name": "云梦"
                    },
                    {
                        "name": "应城"
                    },
                    {
                        "name": "安陆"
                    },
                    {
                        "name": "汉川"
                    }
                ],
                "name": "孝感"
            },
            {
                "sub": [
                    {
                        "name": "沙市"
                    },
                    {
                        "name": "荆州"
                    },
                    {
                        "name": "公安"
                    },
                    {
                        "name": "监利"
                    },
                    {
                        "name": "江陵"
                    },
                    {
                        "name": "石首"
                    },
                    {
                        "name": "洪湖"
                    },
                    {
                        "name": "松滋"
                    }
                ],
                "name": "荆州"
            },
            {
                "sub": [
                    {
                        "name": "黄州"
                    },
                    {
                        "name": "团风"
                    },
                    {
                        "name": "红安"
                    },
                    {
                        "name": "罗田"
                    },
                    {
                        "name": "英山"
                    },
                    {
                        "name": "浠水"
                    },
                    {
                        "name": "蕲春"
                    },
                    {
                        "name": "黄梅"
                    },
                    {
                        "name": "麻城"
                    },
                    {
                        "name": "武穴"
                    }
                ],
                "name": "黄冈"
            },
            {
                "sub": [
                    {
                        "name": "咸安"
                    },
                    {
                        "name": "嘉鱼"
                    },
                    {
                        "name": "通城"
                    },
                    {
                        "name": "崇阳"
                    },
                    {
                        "name": "通山"
                    },
                    {
                        "name": "赤壁"
                    }
                ],
                "name": "咸宁"
            },
            {
                "sub": [
                    {
                        "name": "曾都"
                    },
                    {
                        "name": "随县"
                    },
                    {
                        "name": "广水"
                    }
                ],
                "name": "随州"
            },
            {
                "sub": [
                    {
                        "name": "恩施"
                    },
                    {
                        "name": "利川"
                    },
                    {
                        "name": "建始"
                    },
                    {
                        "name": "巴东"
                    },
                    {
                        "name": "宣恩"
                    },
                    {
                        "name": "咸丰"
                    },
                    {
                        "name": "来凤"
                    },
                    {
                        "name": "鹤峰"
                    }
                ],
                "name": "恩施"
            },
            {
                "name": "仙桃"
            },
            {
                "name": "潜江"
            },
            {
                "name": "天门"
            },
            {
                "name": "神农架林区"
            }
        ],
        "name": "湖北"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "芙蓉"
                    },
                    {
                        "name": "天心"
                    },
                    {
                        "name": "岳麓"
                    },
                    {
                        "name": "开福"
                    },
                    {
                        "name": "雨花"
                    },
                    {
                        "name": "望城"
                    },
                    {
                        "name": "长沙"
                    },
                    {
                        "name": "宁乡"
                    },
                    {
                        "name": "浏阳"
                    }
                ],
                "name": "长沙"
            },
            {
                "sub": [
                    {
                        "name": "荷塘"
                    },
                    {
                        "name": "芦淞"
                    },
                    {
                        "name": "石峰"
                    },
                    {
                        "name": "天元"
                    },
                    {
                        "name": "株洲"
                    },
                    {
                        "name": "攸县"
                    },
                    {
                        "name": "茶陵"
                    },
                    {
                        "name": "炎陵"
                    },
                    {
                        "name": "醴陵"
                    }
                ],
                "name": "株洲"
            },
            {
                "sub": [
                    {
                        "name": "雨湖"
                    },
                    {
                        "name": "岳塘"
                    },
                    {
                        "name": "湘潭"
                    },
                    {
                        "name": "湘乡"
                    },
                    {
                        "name": "韶山"
                    }
                ],
                "name": "湘潭"
            },
            {
                "sub": [
                    {
                        "name": "珠晖"
                    },
                    {
                        "name": "雁峰"
                    },
                    {
                        "name": "石鼓"
                    },
                    {
                        "name": "蒸湘"
                    },
                    {
                        "name": "南岳"
                    },
                    {
                        "name": "衡阳"
                    },
                    {
                        "name": "衡南"
                    },
                    {
                        "name": "衡山"
                    },
                    {
                        "name": "衡东"
                    },
                    {
                        "name": "祁东"
                    },
                    {
                        "name": "耒阳"
                    },
                    {
                        "name": "常宁"
                    }
                ],
                "name": "衡阳"
            },
            {
                "sub": [
                    {
                        "name": "双清"
                    },
                    {
                        "name": "大祥"
                    },
                    {
                        "name": "北塔"
                    },
                    {
                        "name": "邵东"
                    },
                    {
                        "name": "新邵"
                    },
                    {
                        "name": "邵阳"
                    },
                    {
                        "name": "隆回"
                    },
                    {
                        "name": "洞口"
                    },
                    {
                        "name": "绥宁"
                    },
                    {
                        "name": "新宁"
                    },
                    {
                        "name": "城步"
                    },
                    {
                        "name": "武冈"
                    }
                ],
                "name": "邵阳"
            },
            {
                "sub": [
                    {
                        "name": "岳阳楼"
                    },
                    {
                        "name": "云溪"
                    },
                    {
                        "name": "君山"
                    },
                    {
                        "name": "岳阳"
                    },
                    {
                        "name": "华容"
                    },
                    {
                        "name": "湘阴"
                    },
                    {
                        "name": "平江"
                    },
                    {
                        "name": "汨罗"
                    },
                    {
                        "name": "临湘"
                    }
                ],
                "name": "岳阳"
            },
            {
                "sub": [
                    {
                        "name": "武陵"
                    },
                    {
                        "name": "鼎城"
                    },
                    {
                        "name": "安乡"
                    },
                    {
                        "name": "汉寿"
                    },
                    {
                        "name": "澧县"
                    },
                    {
                        "name": "临澧"
                    },
                    {
                        "name": "桃源"
                    },
                    {
                        "name": "石门"
                    },
                    {
                        "name": "津市"
                    }
                ],
                "name": "常德"
            },
            {
                "sub": [
                    {
                        "name": "永定"
                    },
                    {
                        "name": "武陵源"
                    },
                    {
                        "name": "慈利"
                    },
                    {
                        "name": "桑植"
                    }
                ],
                "name": "张家界"
            },
            {
                "sub": [
                    {
                        "name": "资阳"
                    },
                    {
                        "name": "赫山"
                    },
                    {
                        "name": "南县"
                    },
                    {
                        "name": "桃江"
                    },
                    {
                        "name": "安化"
                    },
                    {
                        "name": "沅江"
                    }
                ],
                "name": "益阳"
            },
            {
                "sub": [
                    {
                        "name": "北湖"
                    },
                    {
                        "name": "苏仙"
                    },
                    {
                        "name": "桂阳"
                    },
                    {
                        "name": "宜章"
                    },
                    {
                        "name": "永兴"
                    },
                    {
                        "name": "嘉禾"
                    },
                    {
                        "name": "临武"
                    },
                    {
                        "name": "汝城"
                    },
                    {
                        "name": "桂东"
                    },
                    {
                        "name": "安仁"
                    },
                    {
                        "name": "资兴"
                    }
                ],
                "name": "郴州"
            },
            {
                "sub": [
                    {
                        "name": "零陵"
                    },
                    {
                        "name": "冷水滩"
                    },
                    {
                        "name": "祁阳"
                    },
                    {
                        "name": "东安"
                    },
                    {
                        "name": "双牌"
                    },
                    {
                        "name": "道县"
                    },
                    {
                        "name": "江永"
                    },
                    {
                        "name": "宁远"
                    },
                    {
                        "name": "蓝山"
                    },
                    {
                        "name": "新田"
                    },
                    {
                        "name": "江华"
                    }
                ],
                "name": "永州"
            },
            {
                "sub": [
                    {
                        "name": "鹤城"
                    },
                    {
                        "name": "中方"
                    },
                    {
                        "name": "沅陵"
                    },
                    {
                        "name": "辰溪"
                    },
                    {
                        "name": "溆浦"
                    },
                    {
                        "name": "会同"
                    },
                    {
                        "name": "麻阳"
                    },
                    {
                        "name": "新晃"
                    },
                    {
                        "name": "芷江"
                    },
                    {
                        "name": "靖州"
                    },
                    {
                        "name": "通道"
                    },
                    {
                        "name": "洪江"
                    }
                ],
                "name": "怀化"
            },
            {
                "sub": [
                    {
                        "name": "娄星"
                    },
                    {
                        "name": "双峰"
                    },
                    {
                        "name": "新化"
                    },
                    {
                        "name": "冷水江"
                    },
                    {
                        "name": "涟源"
                    }
                ],
                "name": "娄底"
            },
            {
                "sub": [
                    {
                        "name": "吉首"
                    },
                    {
                        "name": "泸溪"
                    },
                    {
                        "name": "凤凰"
                    },
                    {
                        "name": "花垣"
                    },
                    {
                        "name": "保靖"
                    },
                    {
                        "name": "古丈"
                    },
                    {
                        "name": "永顺"
                    },
                    {
                        "name": "龙山"
                    }
                ],
                "name": "湘西"
            }
        ],
        "name": "湖南"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "荔湾"
                    },
                    {
                        "name": "越秀"
                    },
                    {
                        "name": "海珠"
                    },
                    {
                        "name": "天河"
                    },
                    {
                        "name": "白云"
                    },
                    {
                        "name": "黄埔"
                    },
                    {
                        "name": "番禺"
                    },
                    {
                        "name": "花都"
                    },
                    {
                        "name": "南沙"
                    },
                    {
                        "name": "增城"
                    },
                    {
                        "name": "从化"
                    }
                ],
                "name": "广州"
            },
            {
                "sub": [
                    {
                        "name": "武江"
                    },
                    {
                        "name": "浈江"
                    },
                    {
                        "name": "曲江"
                    },
                    {
                        "name": "始兴"
                    },
                    {
                        "name": "仁化"
                    },
                    {
                        "name": "翁源"
                    },
                    {
                        "name": "乳源"
                    },
                    {
                        "name": "新丰"
                    },
                    {
                        "name": "乐昌"
                    },
                    {
                        "name": "南雄"
                    }
                ],
                "name": "韶关"
            },
            {
                "sub": [
                    {
                        "name": "罗湖"
                    },
                    {
                        "name": "福田"
                    },
                    {
                        "name": "南山"
                    },
                    {
                        "name": "宝安"
                    },
                    {
                        "name": "龙岗"
                    },
                    {
                        "name": "盐田"
                    },
                    {
                        "name": "龙华"
                    },
                    {
                        "name": "坪山"
                    }
                ],
                "name": "深圳"
            },
            {
                "sub": [
                    {
                        "name": "香洲"
                    },
                    {
                        "name": "斗门"
                    },
                    {
                        "name": "金湾"
                    }
                ],
                "name": "珠海"
            },
            {
                "sub": [
                    {
                        "name": "龙湖"
                    },
                    {
                        "name": "金平"
                    },
                    {
                        "name": "濠江"
                    },
                    {
                        "name": "潮阳"
                    },
                    {
                        "name": "潮南"
                    },
                    {
                        "name": "澄海"
                    },
                    {
                        "name": "南澳"
                    }
                ],
                "name": "汕头"
            },
            {
                "sub": [
                    {
                        "name": "禅城"
                    },
                    {
                        "name": "南海"
                    },
                    {
                        "name": "顺德"
                    },
                    {
                        "name": "三水"
                    },
                    {
                        "name": "高明"
                    }
                ],
                "name": "佛山"
            },
            {
                "sub": [
                    {
                        "name": "蓬江"
                    },
                    {
                        "name": "江海"
                    },
                    {
                        "name": "新会"
                    },
                    {
                        "name": "台山"
                    },
                    {
                        "name": "开平"
                    },
                    {
                        "name": "鹤山"
                    },
                    {
                        "name": "恩平"
                    }
                ],
                "name": "江门"
            },
            {
                "sub": [
                    {
                        "name": "赤坎"
                    },
                    {
                        "name": "霞山"
                    },
                    {
                        "name": "坡头"
                    },
                    {
                        "name": "麻章"
                    },
                    {
                        "name": "遂溪"
                    },
                    {
                        "name": "徐闻"
                    },
                    {
                        "name": "廉江"
                    },
                    {
                        "name": "雷州"
                    },
                    {
                        "name": "吴川"
                    }
                ],
                "name": "湛江"
            },
            {
                "sub": [
                    {
                        "name": "茂南"
                    },
                    {
                        "name": "电白"
                    },
                    {
                        "name": "高州"
                    },
                    {
                        "name": "化州"
                    },
                    {
                        "name": "信宜"
                    }
                ],
                "name": "茂名"
            },
            {
                "sub": [
                    {
                        "name": "端州"
                    },
                    {
                        "name": "鼎湖"
                    },
                    {
                        "name": "广宁"
                    },
                    {
                        "name": "怀集"
                    },
                    {
                        "name": "封开"
                    },
                    {
                        "name": "德庆"
                    },
                    {
                        "name": "高要"
                    },
                    {
                        "name": "四会"
                    }
                ],
                "name": "肇庆"
            },
            {
                "sub": [
                    {
                        "name": "惠城"
                    },
                    {
                        "name": "惠阳"
                    },
                    {
                        "name": "博罗"
                    },
                    {
                        "name": "惠东"
                    },
                    {
                        "name": "龙门"
                    }
                ],
                "name": "惠州"
            },
            {
                "sub": [
                    {
                        "name": "梅江"
                    },
                    {
                        "name": "梅县"
                    },
                    {
                        "name": "大埔"
                    },
                    {
                        "name": "丰顺"
                    },
                    {
                        "name": "五华"
                    },
                    {
                        "name": "平远"
                    },
                    {
                        "name": "蕉岭"
                    },
                    {
                        "name": "兴宁"
                    }
                ],
                "name": "梅州"
            },
            {
                "sub": [
                    {
                        "name": "城区"
                    },
                    {
                        "name": "海丰"
                    },
                    {
                        "name": "陆河"
                    },
                    {
                        "name": "陆丰"
                    }
                ],
                "name": "汕尾"
            },
            {
                "sub": [
                    {
                        "name": "源城"
                    },
                    {
                        "name": "紫金"
                    },
                    {
                        "name": "龙川"
                    },
                    {
                        "name": "连平"
                    },
                    {
                        "name": "和平"
                    },
                    {
                        "name": "东源"
                    }
                ],
                "name": "河源"
            },
            {
                "sub": [
                    {
                        "name": "江城"
                    },
                    {
                        "name": "阳西"
                    },
                    {
                        "name": "阳东"
                    },
                    {
                        "name": "阳春"
                    }
                ],
                "name": "阳江"
            },
            {
                "sub": [
                    {
                        "name": "清城"
                    },
                    {
                        "name": "佛冈"
                    },
                    {
                        "name": "阳山"
                    },
                    {
                        "name": "连山"
                    },
                    {
                        "name": "连南"
                    },
                    {
                        "name": "清新"
                    },
                    {
                        "name": "英德"
                    },
                    {
                        "name": "连州"
                    }
                ],
                "name": "清远"
            },
            {
                "name": "东莞"
            },
            {
                "name": "中山"
            },
            {
                "sub": [
                    {
                        "name": "湘桥"
                    },
                    {
                        "name": "潮安"
                    },
                    {
                        "name": "饶平"
                    }
                ],
                "name": "潮州"
            },
            {
                "sub": [
                    {
                        "name": "榕城"
                    },
                    {
                        "name": "揭东"
                    },
                    {
                        "name": "揭西"
                    },
                    {
                        "name": "惠来"
                    },
                    {
                        "name": "普宁"
                    }
                ],
                "name": "揭阳"
            },
            {
                "sub": [
                    {
                        "name": "云城"
                    },
                    {
                        "name": "新兴"
                    },
                    {
                        "name": "郁南"
                    },
                    {
                        "name": "云安"
                    },
                    {
                        "name": "罗定"
                    }
                ],
                "name": "云浮"
            }
        ],
        "name": "广东"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "兴宁"
                    },
                    {
                        "name": "青秀"
                    },
                    {
                        "name": "江南"
                    },
                    {
                        "name": "西乡塘"
                    },
                    {
                        "name": "良庆"
                    },
                    {
                        "name": "邕宁"
                    },
                    {
                        "name": "武鸣"
                    },
                    {
                        "name": "隆安"
                    },
                    {
                        "name": "马山"
                    },
                    {
                        "name": "上林"
                    },
                    {
                        "name": "宾阳"
                    },
                    {
                        "name": "横县"
                    }
                ],
                "name": "南宁"
            },
            {
                "sub": [
                    {
                        "name": "城中"
                    },
                    {
                        "name": "鱼峰"
                    },
                    {
                        "name": "柳南"
                    },
                    {
                        "name": "柳北"
                    },
                    {
                        "name": "柳江"
                    },
                    {
                        "name": "柳城"
                    },
                    {
                        "name": "鹿寨"
                    },
                    {
                        "name": "融安"
                    },
                    {
                        "name": "融水"
                    },
                    {
                        "name": "三江"
                    }
                ],
                "name": "柳州"
            },
            {
                "sub": [
                    {
                        "name": "秀峰"
                    },
                    {
                        "name": "叠彩"
                    },
                    {
                        "name": "象山"
                    },
                    {
                        "name": "七星"
                    },
                    {
                        "name": "雁山"
                    },
                    {
                        "name": "阳朔"
                    },
                    {
                        "name": "临桂"
                    },
                    {
                        "name": "灵川"
                    },
                    {
                        "name": "全州"
                    },
                    {
                        "name": "兴安"
                    },
                    {
                        "name": "永福"
                    },
                    {
                        "name": "灌阳"
                    },
                    {
                        "name": "龙胜"
                    },
                    {
                        "name": "资源"
                    },
                    {
                        "name": "平乐"
                    },
                    {
                        "name": "荔浦"
                    },
                    {
                        "name": "恭城"
                    }
                ],
                "name": "桂林"
            },
            {
                "sub": [
                    {
                        "name": "龙圩"
                    },
                    {
                        "name": "万秀"
                    },
                    {
                        "name": "长洲"
                    },
                    {
                        "name": "苍梧"
                    },
                    {
                        "name": "藤县"
                    },
                    {
                        "name": "蒙山"
                    },
                    {
                        "name": "岑溪"
                    }
                ],
                "name": "梧州"
            },
            {
                "sub": [
                    {
                        "name": "海城"
                    },
                    {
                        "name": "银海"
                    },
                    {
                        "name": "铁山港"
                    },
                    {
                        "name": "合浦"
                    }
                ],
                "name": "北海"
            },
            {
                "sub": [
                    {
                        "name": "港口"
                    },
                    {
                        "name": "防城"
                    },
                    {
                        "name": "上思"
                    },
                    {
                        "name": "东兴"
                    }
                ],
                "name": "防城港"
            },
            {
                "sub": [
                    {
                        "name": "钦南"
                    },
                    {
                        "name": "钦北"
                    },
                    {
                        "name": "灵山"
                    },
                    {
                        "name": "浦北"
                    }
                ],
                "name": "钦州"
            },
            {
                "sub": [
                    {
                        "name": "港北"
                    },
                    {
                        "name": "港南"
                    },
                    {
                        "name": "覃塘"
                    },
                    {
                        "name": "桂平"
                    },
                    {
                        "name": "平南"
                    }
                ],
                "name": "贵港"
            },
            {
                "sub": [
                    {
                        "name": "玉州"
                    },
                    {
                        "name": "容县"
                    },
                    {
                        "name": "陆川"
                    },
                    {
                        "name": "博白"
                    },
                    {
                        "name": "兴业"
                    },
                    {
                        "name": "北流"
                    },
                    {
                        "name": "福绵"
                    }
                ],
                "name": "玉林"
            },
            {
                "sub": [
                    {
                        "name": "右江"
                    },
                    {
                        "name": "田阳"
                    },
                    {
                        "name": "田东"
                    },
                    {
                        "name": "平果"
                    },
                    {
                        "name": "德保"
                    },
                    {
                        "name": "靖西"
                    },
                    {
                        "name": "那坡"
                    },
                    {
                        "name": "凌云"
                    },
                    {
                        "name": "乐业"
                    },
                    {
                        "name": "田林"
                    },
                    {
                        "name": "西林"
                    },
                    {
                        "name": "隆林"
                    }
                ],
                "name": "百色"
            },
            {
                "sub": [
                    {
                        "name": "八步"
                    },
                    {
                        "name": "昭平"
                    },
                    {
                        "name": "钟山"
                    },
                    {
                        "name": "富川"
                    },
                    {
                        "name": "平桂"
                    }
                ],
                "name": "贺州"
            },
            {
                "sub": [
                    {
                        "name": "金城江"
                    },
                    {
                        "name": "南丹"
                    },
                    {
                        "name": "天峨"
                    },
                    {
                        "name": "凤山"
                    },
                    {
                        "name": "东兰"
                    },
                    {
                        "name": "罗城"
                    },
                    {
                        "name": "环江"
                    },
                    {
                        "name": "巴马"
                    },
                    {
                        "name": "都安"
                    },
                    {
                        "name": "大化"
                    },
                    {
                        "name": "宜州"
                    }
                ],
                "name": "河池"
            },
            {
                "sub": [
                    {
                        "name": "兴宾"
                    },
                    {
                        "name": "忻城"
                    },
                    {
                        "name": "象州"
                    },
                    {
                        "name": "武宣"
                    },
                    {
                        "name": "金秀"
                    },
                    {
                        "name": "合山"
                    }
                ],
                "name": "来宾"
            },
            {
                "sub": [
                    {
                        "name": "江州"
                    },
                    {
                        "name": "扶绥"
                    },
                    {
                        "name": "宁明"
                    },
                    {
                        "name": "龙州"
                    },
                    {
                        "name": "大新"
                    },
                    {
                        "name": "天等"
                    },
                    {
                        "name": "凭祥"
                    }
                ],
                "name": "崇左"
            }
        ],
        "name": "广西"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "秀英"
                    },
                    {
                        "name": "龙华"
                    },
                    {
                        "name": "琼山"
                    },
                    {
                        "name": "美兰"
                    }
                ],
                "name": "海口"
            },
            {
                "sub": [
                    {
                        "name": "海棠"
                    },
                    {
                        "name": "吉阳"
                    },
                    {
                        "name": "天涯"
                    },
                    {
                        "name": "崖州"
                    }
                ],
                "name": "三亚"
            },
            {
                "name": "三沙"
            },
            {
                "name": "五指山"
            },
            {
                "name": "琼海"
            },
            {
                "name": "儋州"
            },
            {
                "name": "文昌"
            },
            {
                "name": "万宁"
            },
            {
                "name": "东方"
            },
            {
                "name": "定安"
            },
            {
                "name": "屯昌"
            },
            {
                "name": "澄迈"
            },
            {
                "name": "临高"
            },
            {
                "name": "白沙"
            },
            {
                "name": "昌江"
            },
            {
                "name": "乐东"
            },
            {
                "name": "陵水"
            },
            {
                "name": "保亭"
            },
            {
                "name": "琼中"
            }
        ],
        "name": "海南"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "锦江"
                    },
                    {
                        "name": "青羊"
                    },
                    {
                        "name": "金牛"
                    },
                    {
                        "name": "武侯"
                    },
                    {
                        "name": "成华"
                    },
                    {
                        "name": "龙泉驿"
                    },
                    {
                        "name": "青白江"
                    },
                    {
                        "name": "新都"
                    },
                    {
                        "name": "温江"
                    },
                    {
                        "name": "金堂"
                    },
                    {
                        "name": "双流"
                    },
                    {
                        "name": "郫都"
                    },
                    {
                        "name": "大邑"
                    },
                    {
                        "name": "蒲江"
                    },
                    {
                        "name": "新津"
                    },
                    {
                        "name": "都江堰"
                    },
                    {
                        "name": "彭州"
                    },
                    {
                        "name": "邛崃"
                    },
                    {
                        "name": "崇州"
                    },
                    {
                        "name": "简阳"
                    }
                ],
                "name": "成都"
            },
            {
                "sub": [
                    {
                        "name": "自流井"
                    },
                    {
                        "name": "贡井"
                    },
                    {
                        "name": "大安"
                    },
                    {
                        "name": "沿滩"
                    },
                    {
                        "name": "荣县"
                    },
                    {
                        "name": "富顺"
                    }
                ],
                "name": "自贡"
            },
            {
                "sub": [
                    {
                        "name": "东区"
                    },
                    {
                        "name": "西区"
                    },
                    {
                        "name": "仁和"
                    },
                    {
                        "name": "米易"
                    },
                    {
                        "name": "盐边"
                    }
                ],
                "name": "攀枝花"
            },
            {
                "sub": [
                    {
                        "name": "江阳"
                    },
                    {
                        "name": "纳溪"
                    },
                    {
                        "name": "龙马潭"
                    },
                    {
                        "name": "泸县"
                    },
                    {
                        "name": "合江"
                    },
                    {
                        "name": "叙永"
                    },
                    {
                        "name": "古蔺"
                    }
                ],
                "name": "泸州"
            },
            {
                "sub": [
                    {
                        "name": "旌阳"
                    },
                    {
                        "name": "中江"
                    },
                    {
                        "name": "罗江"
                    },
                    {
                        "name": "广汉"
                    },
                    {
                        "name": "什邡"
                    },
                    {
                        "name": "绵竹"
                    }
                ],
                "name": "德阳"
            },
            {
                "sub": [
                    {
                        "name": "涪城"
                    },
                    {
                        "name": "游仙"
                    },
                    {
                        "name": "三台"
                    },
                    {
                        "name": "盐亭"
                    },
                    {
                        "name": "安州"
                    },
                    {
                        "name": "梓潼"
                    },
                    {
                        "name": "北川"
                    },
                    {
                        "name": "平武"
                    },
                    {
                        "name": "江油"
                    }
                ],
                "name": "绵阳"
            },
            {
                "sub": [
                    {
                        "name": "利州"
                    },
                    {
                        "name": "昭化"
                    },
                    {
                        "name": "朝天"
                    },
                    {
                        "name": "旺苍"
                    },
                    {
                        "name": "青川"
                    },
                    {
                        "name": "剑阁"
                    },
                    {
                        "name": "苍溪"
                    }
                ],
                "name": "广元"
            },
            {
                "sub": [
                    {
                        "name": "船山"
                    },
                    {
                        "name": "安居"
                    },
                    {
                        "name": "蓬溪"
                    },
                    {
                        "name": "射洪"
                    },
                    {
                        "name": "大英"
                    }
                ],
                "name": "遂宁"
            },
            {
                "sub": [
                    {
                        "name": "市中"
                    },
                    {
                        "name": "东兴"
                    },
                    {
                        "name": "威远"
                    },
                    {
                        "name": "资中"
                    },
                    {
                        "name": "隆昌"
                    }
                ],
                "name": "内江"
            },
            {
                "sub": [
                    {
                        "name": "市中"
                    },
                    {
                        "name": "沙湾"
                    },
                    {
                        "name": "五通桥"
                    },
                    {
                        "name": "金口河"
                    },
                    {
                        "name": "犍为"
                    },
                    {
                        "name": "井研"
                    },
                    {
                        "name": "夹江"
                    },
                    {
                        "name": "沐川"
                    },
                    {
                        "name": "峨边"
                    },
                    {
                        "name": "马边"
                    },
                    {
                        "name": "峨眉山"
                    }
                ],
                "name": "乐山"
            },
            {
                "sub": [
                    {
                        "name": "顺庆"
                    },
                    {
                        "name": "高坪"
                    },
                    {
                        "name": "嘉陵"
                    },
                    {
                        "name": "南部"
                    },
                    {
                        "name": "营山"
                    },
                    {
                        "name": "蓬安"
                    },
                    {
                        "name": "仪陇"
                    },
                    {
                        "name": "西充"
                    },
                    {
                        "name": "阆中"
                    }
                ],
                "name": "南充"
            },
            {
                "sub": [
                    {
                        "name": "东坡"
                    },
                    {
                        "name": "仁寿"
                    },
                    {
                        "name": "彭山"
                    },
                    {
                        "name": "洪雅"
                    },
                    {
                        "name": "丹棱"
                    },
                    {
                        "name": "青神"
                    }
                ],
                "name": "眉山"
            },
            {
                "sub": [
                    {
                        "name": "翠屏"
                    },
                    {
                        "name": "南溪"
                    },
                    {
                        "name": "宜宾"
                    },
                    {
                        "name": "江安"
                    },
                    {
                        "name": "长宁"
                    },
                    {
                        "name": "高县"
                    },
                    {
                        "name": "珙县"
                    },
                    {
                        "name": "筠连"
                    },
                    {
                        "name": "兴文"
                    },
                    {
                        "name": "屏山"
                    }
                ],
                "name": "宜宾"
            },
            {
                "sub": [
                    {
                        "name": "广安"
                    },
                    {
                        "name": "岳池"
                    },
                    {
                        "name": "武胜"
                    },
                    {
                        "name": "邻水"
                    },
                    {
                        "name": "华蓥"
                    },
                    {
                        "name": "前锋"
                    }
                ],
                "name": "广安"
            },
            {
                "sub": [
                    {
                        "name": "通川"
                    },
                    {
                        "name": "达川"
                    },
                    {
                        "name": "宣汉"
                    },
                    {
                        "name": "开江"
                    },
                    {
                        "name": "大竹"
                    },
                    {
                        "name": "渠县"
                    },
                    {
                        "name": "万源"
                    }
                ],
                "name": "达州"
            },
            {
                "sub": [
                    {
                        "name": "雨城"
                    },
                    {
                        "name": "名山"
                    },
                    {
                        "name": "荥经"
                    },
                    {
                        "name": "汉源"
                    },
                    {
                        "name": "石棉"
                    },
                    {
                        "name": "天全"
                    },
                    {
                        "name": "芦山"
                    },
                    {
                        "name": "宝兴"
                    }
                ],
                "name": "雅安"
            },
            {
                "sub": [
                    {
                        "name": "巴州"
                    },
                    {
                        "name": "通江"
                    },
                    {
                        "name": "南江"
                    },
                    {
                        "name": "平昌"
                    }
                ],
                "name": "巴中"
            },
            {
                "sub": [
                    {
                        "name": "雁江"
                    },
                    {
                        "name": "安岳"
                    },
                    {
                        "name": "乐至"
                    }
                ],
                "name": "资阳"
            },
            {
                "sub": [
                    {
                        "name": "马尔康"
                    },
                    {
                        "name": "汶川"
                    },
                    {
                        "name": "理县"
                    },
                    {
                        "name": "茂县"
                    },
                    {
                        "name": "松潘"
                    },
                    {
                        "name": "九寨沟"
                    },
                    {
                        "name": "金川"
                    },
                    {
                        "name": "小金"
                    },
                    {
                        "name": "黑水"
                    },
                    {
                        "name": "壤塘"
                    },
                    {
                        "name": "阿坝"
                    },
                    {
                        "name": "若尔盖"
                    },
                    {
                        "name": "红原"
                    }
                ],
                "name": "阿坝"
            },
            {
                "sub": [
                    {
                        "name": "康定"
                    },
                    {
                        "name": "泸定"
                    },
                    {
                        "name": "丹巴"
                    },
                    {
                        "name": "九龙"
                    },
                    {
                        "name": "雅江"
                    },
                    {
                        "name": "道孚"
                    },
                    {
                        "name": "炉霍"
                    },
                    {
                        "name": "甘孜"
                    },
                    {
                        "name": "新龙"
                    },
                    {
                        "name": "德格"
                    },
                    {
                        "name": "白玉"
                    },
                    {
                        "name": "石渠"
                    },
                    {
                        "name": "色达"
                    },
                    {
                        "name": "理塘"
                    },
                    {
                        "name": "巴塘"
                    },
                    {
                        "name": "乡城"
                    },
                    {
                        "name": "稻城"
                    },
                    {
                        "name": "得荣"
                    }
                ],
                "name": "甘孜"
            },
            {
                "sub": [
                    {
                        "name": "西昌"
                    },
                    {
                        "name": "木里"
                    },
                    {
                        "name": "盐源"
                    },
                    {
                        "name": "德昌"
                    },
                    {
                        "name": "会理"
                    },
                    {
                        "name": "会东"
                    },
                    {
                        "name": "宁南"
                    },
                    {
                        "name": "普格"
                    },
                    {
                        "name": "布拖"
                    },
                    {
                        "name": "金阳"
                    },
                    {
                        "name": "昭觉"
                    },
                    {
                        "name": "喜德"
                    },
                    {
                        "name": "冕宁"
                    },
                    {
                        "name": "越西"
                    },
                    {
                        "name": "甘洛"
                    },
                    {
                        "name": "美姑"
                    },
                    {
                        "name": "雷波"
                    }
                ],
                "name": "凉山"
            }
        ],
        "name": "四川"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "观山湖"
                    },
                    {
                        "name": "南明"
                    },
                    {
                        "name": "云岩"
                    },
                    {
                        "name": "花溪"
                    },
                    {
                        "name": "乌当"
                    },
                    {
                        "name": "白云"
                    },
                    {
                        "name": "开阳"
                    },
                    {
                        "name": "息烽"
                    },
                    {
                        "name": "修文"
                    },
                    {
                        "name": "清镇"
                    }
                ],
                "name": "贵阳"
            },
            {
                "sub": [
                    {
                        "name": "钟山"
                    },
                    {
                        "name": "六枝特"
                    },
                    {
                        "name": "水城"
                    },
                    {
                        "name": "盘县"
                    }
                ],
                "name": "六盘水"
            },
            {
                "sub": [
                    {
                        "name": "红花岗"
                    },
                    {
                        "name": "汇川"
                    },
                    {
                        "name": "播州"
                    },
                    {
                        "name": "桐梓"
                    },
                    {
                        "name": "绥阳"
                    },
                    {
                        "name": "正安"
                    },
                    {
                        "name": "道真"
                    },
                    {
                        "name": "务川"
                    },
                    {
                        "name": "凤冈"
                    },
                    {
                        "name": "湄潭"
                    },
                    {
                        "name": "余庆"
                    },
                    {
                        "name": "习水"
                    },
                    {
                        "name": "赤水"
                    },
                    {
                        "name": "仁怀"
                    }
                ],
                "name": "遵义"
            },
            {
                "sub": [
                    {
                        "name": "西秀"
                    },
                    {
                        "name": "平坝"
                    },
                    {
                        "name": "普定"
                    },
                    {
                        "name": "镇宁"
                    },
                    {
                        "name": "关岭"
                    },
                    {
                        "name": "紫云"
                    }
                ],
                "name": "安顺"
            },
            {
                "sub": [
                    {
                        "name": "七星关"
                    },
                    {
                        "name": "大方"
                    },
                    {
                        "name": "黔西"
                    },
                    {
                        "name": "金沙"
                    },
                    {
                        "name": "织金"
                    },
                    {
                        "name": "纳雍"
                    },
                    {
                        "name": "威宁"
                    },
                    {
                        "name": "赫章"
                    }
                ],
                "name": "毕节"
            },
            {
                "sub": [
                    {
                        "name": "碧江"
                    },
                    {
                        "name": "万山"
                    },
                    {
                        "name": "江口"
                    },
                    {
                        "name": "玉屏"
                    },
                    {
                        "name": "石阡"
                    },
                    {
                        "name": "思南"
                    },
                    {
                        "name": "印江"
                    },
                    {
                        "name": "德江"
                    },
                    {
                        "name": "沿河"
                    },
                    {
                        "name": "松桃"
                    }
                ],
                "name": "铜仁"
            },
            {
                "sub": [
                    {
                        "name": "兴义"
                    },
                    {
                        "name": "兴仁"
                    },
                    {
                        "name": "普安"
                    },
                    {
                        "name": "晴隆"
                    },
                    {
                        "name": "贞丰"
                    },
                    {
                        "name": "望谟"
                    },
                    {
                        "name": "册亨"
                    },
                    {
                        "name": "安龙"
                    }
                ],
                "name": "黔西南"
            },
            {
                "sub": [
                    {
                        "name": "凯里"
                    },
                    {
                        "name": "黄平"
                    },
                    {
                        "name": "施秉"
                    },
                    {
                        "name": "三穗"
                    },
                    {
                        "name": "镇远"
                    },
                    {
                        "name": "岑巩"
                    },
                    {
                        "name": "天柱"
                    },
                    {
                        "name": "锦屏"
                    },
                    {
                        "name": "剑河"
                    },
                    {
                        "name": "台江"
                    },
                    {
                        "name": "黎平"
                    },
                    {
                        "name": "榕江"
                    },
                    {
                        "name": "从江"
                    },
                    {
                        "name": "雷山"
                    },
                    {
                        "name": "麻江"
                    },
                    {
                        "name": "丹寨"
                    }
                ],
                "name": "黔东南"
            },
            {
                "sub": [
                    {
                        "name": "都匀"
                    },
                    {
                        "name": "福泉"
                    },
                    {
                        "name": "荔波"
                    },
                    {
                        "name": "贵定"
                    },
                    {
                        "name": "瓮安"
                    },
                    {
                        "name": "独山"
                    },
                    {
                        "name": "平塘"
                    },
                    {
                        "name": "罗甸"
                    },
                    {
                        "name": "长顺"
                    },
                    {
                        "name": "龙里"
                    },
                    {
                        "name": "惠水"
                    },
                    {
                        "name": "三都"
                    }
                ],
                "name": "黔南"
            }
        ],
        "name": "贵州"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "五华"
                    },
                    {
                        "name": "盘龙"
                    },
                    {
                        "name": "官渡"
                    },
                    {
                        "name": "西山"
                    },
                    {
                        "name": "东川"
                    },
                    {
                        "name": "呈贡"
                    },
                    {
                        "name": "晋宁"
                    },
                    {
                        "name": "富民"
                    },
                    {
                        "name": "宜良"
                    },
                    {
                        "name": "石林"
                    },
                    {
                        "name": "嵩明"
                    },
                    {
                        "name": "禄劝"
                    },
                    {
                        "name": "寻甸"
                    },
                    {
                        "name": "安宁"
                    }
                ],
                "name": "昆明"
            },
            {
                "sub": [
                    {
                        "name": "麒麟"
                    },
                    {
                        "name": "马龙"
                    },
                    {
                        "name": "陆良"
                    },
                    {
                        "name": "师宗"
                    },
                    {
                        "name": "罗平"
                    },
                    {
                        "name": "富源"
                    },
                    {
                        "name": "会泽"
                    },
                    {
                        "name": "沾益"
                    },
                    {
                        "name": "宣威"
                    }
                ],
                "name": "曲靖"
            },
            {
                "sub": [
                    {
                        "name": "红塔"
                    },
                    {
                        "name": "江川"
                    },
                    {
                        "name": "澄江"
                    },
                    {
                        "name": "通海"
                    },
                    {
                        "name": "华宁"
                    },
                    {
                        "name": "易门"
                    },
                    {
                        "name": "峨山"
                    },
                    {
                        "name": "新平"
                    },
                    {
                        "name": "元江"
                    }
                ],
                "name": "玉溪"
            },
            {
                "sub": [
                    {
                        "name": "昭阳"
                    },
                    {
                        "name": "鲁甸"
                    },
                    {
                        "name": "巧家"
                    },
                    {
                        "name": "盐津"
                    },
                    {
                        "name": "大关"
                    },
                    {
                        "name": "永善"
                    },
                    {
                        "name": "绥江"
                    },
                    {
                        "name": "镇雄"
                    },
                    {
                        "name": "彝良"
                    },
                    {
                        "name": "威信"
                    },
                    {
                        "name": "水富"
                    }
                ],
                "name": "昭通"
            },
            {
                "sub": [
                    {
                        "name": "古城"
                    },
                    {
                        "name": "玉龙"
                    },
                    {
                        "name": "永胜"
                    },
                    {
                        "name": "华坪"
                    },
                    {
                        "name": "宁蒗"
                    }
                ],
                "name": "丽江"
            },
            {
                "sub": [
                    {
                        "name": "思茅"
                    },
                    {
                        "name": "宁洱"
                    },
                    {
                        "name": "墨江"
                    },
                    {
                        "name": "景东"
                    },
                    {
                        "name": "景谷"
                    },
                    {
                        "name": "镇沅"
                    },
                    {
                        "name": "江城"
                    },
                    {
                        "name": "孟连"
                    },
                    {
                        "name": "澜沧"
                    },
                    {
                        "name": "西盟"
                    }
                ],
                "name": "普洱"
            },
            {
                "sub": [
                    {
                        "name": "临翔"
                    },
                    {
                        "name": "凤庆"
                    },
                    {
                        "name": "云县"
                    },
                    {
                        "name": "永德"
                    },
                    {
                        "name": "镇康"
                    },
                    {
                        "name": "双江"
                    },
                    {
                        "name": "耿马"
                    },
                    {
                        "name": "沧源"
                    }
                ],
                "name": "临沧"
            },
            {
                "sub": [
                    {
                        "name": "楚雄"
                    },
                    {
                        "name": "双柏"
                    },
                    {
                        "name": "牟定"
                    },
                    {
                        "name": "南华"
                    },
                    {
                        "name": "姚安"
                    },
                    {
                        "name": "大姚"
                    },
                    {
                        "name": "永仁"
                    },
                    {
                        "name": "元谋"
                    },
                    {
                        "name": "武定"
                    },
                    {
                        "name": "禄丰"
                    }
                ],
                "name": "楚雄"
            },
            {
                "sub": [
                    {
                        "name": "个旧"
                    },
                    {
                        "name": "开远"
                    },
                    {
                        "name": "蒙自"
                    },
                    {
                        "name": "屏边"
                    },
                    {
                        "name": "建水"
                    },
                    {
                        "name": "石屏"
                    },
                    {
                        "name": "弥勒"
                    },
                    {
                        "name": "泸西"
                    },
                    {
                        "name": "元阳"
                    },
                    {
                        "name": "红河"
                    },
                    {
                        "name": "金平"
                    },
                    {
                        "name": "绿春"
                    },
                    {
                        "name": "河口"
                    }
                ],
                "name": "红河"
            },
            {
                "sub": [
                    {
                        "name": "文山"
                    },
                    {
                        "name": "砚山"
                    },
                    {
                        "name": "西畴"
                    },
                    {
                        "name": "麻栗坡"
                    },
                    {
                        "name": "马关"
                    },
                    {
                        "name": "丘北"
                    },
                    {
                        "name": "广南"
                    },
                    {
                        "name": "富宁"
                    }
                ],
                "name": "文山"
            },
            {
                "sub": [
                    {
                        "name": "景洪"
                    },
                    {
                        "name": "勐海"
                    },
                    {
                        "name": "勐腊"
                    }
                ],
                "name": "西双版纳"
            },
            {
                "sub": [
                    {
                        "name": "大理"
                    },
                    {
                        "name": "漾濞"
                    },
                    {
                        "name": "祥云"
                    },
                    {
                        "name": "宾川"
                    },
                    {
                        "name": "弥渡"
                    },
                    {
                        "name": "南涧"
                    },
                    {
                        "name": "巍山"
                    },
                    {
                        "name": "永平"
                    },
                    {
                        "name": "云龙"
                    },
                    {
                        "name": "洱源"
                    },
                    {
                        "name": "剑川"
                    },
                    {
                        "name": "鹤庆"
                    }
                ],
                "name": "大理"
            },
            {
                "sub": [
                    {
                        "name": "瑞丽"
                    },
                    {
                        "name": "芒市"
                    },
                    {
                        "name": "梁河"
                    },
                    {
                        "name": "盈江"
                    },
                    {
                        "name": "陇川"
                    }
                ],
                "name": "德宏"
            },
            {
                "sub": [
                    {
                        "name": "泸水"
                    },
                    {
                        "name": "福贡"
                    },
                    {
                        "name": "贡山"
                    },
                    {
                        "name": "兰坪"
                    }
                ],
                "name": "怒江"
            },
            {
                "sub": [
                    {
                        "name": "香格里拉"
                    },
                    {
                        "name": "德钦"
                    },
                    {
                        "name": "维西"
                    }
                ],
                "name": "迪庆"
            },
            {
                "sub": [
                    {
                        "name": "隆阳"
                    },
                    {
                        "name": "施甸"
                    },
                    {
                        "name": "腾冲"
                    },
                    {
                        "name": "龙陵"
                    },
                    {
                        "name": "昌宁"
                    }
                ],
                "name": "保山"
            }
        ],
        "name": "云南"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "城关"
                    },
                    {
                        "name": "林周"
                    },
                    {
                        "name": "当雄"
                    },
                    {
                        "name": "尼木"
                    },
                    {
                        "name": "曲水"
                    },
                    {
                        "name": "堆龙德庆"
                    },
                    {
                        "name": "达孜"
                    },
                    {
                        "name": "墨竹工卡"
                    }
                ],
                "name": "拉萨"
            },
            {
                "sub": [
                    {
                        "name": "卡若"
                    },
                    {
                        "name": "江达"
                    },
                    {
                        "name": "贡觉"
                    },
                    {
                        "name": "类乌齐"
                    },
                    {
                        "name": "丁青"
                    },
                    {
                        "name": "察雅"
                    },
                    {
                        "name": "八宿"
                    },
                    {
                        "name": "左贡"
                    },
                    {
                        "name": "芒康"
                    },
                    {
                        "name": "洛隆"
                    },
                    {
                        "name": "边坝"
                    }
                ],
                "name": "昌都"
            },
            {
                "sub": [
                    {
                        "name": "乃东"
                    },
                    {
                        "name": "扎囊"
                    },
                    {
                        "name": "贡嘎"
                    },
                    {
                        "name": "桑日"
                    },
                    {
                        "name": "琼结"
                    },
                    {
                        "name": "曲松"
                    },
                    {
                        "name": "措美"
                    },
                    {
                        "name": "洛扎"
                    },
                    {
                        "name": "加查"
                    },
                    {
                        "name": "隆子"
                    },
                    {
                        "name": "错那"
                    },
                    {
                        "name": "浪卡子"
                    }
                ],
                "name": "山南"
            },
            {
                "sub": [
                    {
                        "name": "桑珠孜"
                    },
                    {
                        "name": "南木林"
                    },
                    {
                        "name": "江孜"
                    },
                    {
                        "name": "定日"
                    },
                    {
                        "name": "萨迦"
                    },
                    {
                        "name": "拉孜"
                    },
                    {
                        "name": "昂仁"
                    },
                    {
                        "name": "谢通门"
                    },
                    {
                        "name": "白朗"
                    },
                    {
                        "name": "仁布"
                    },
                    {
                        "name": "康马"
                    },
                    {
                        "name": "定结"
                    },
                    {
                        "name": "仲巴"
                    },
                    {
                        "name": "亚东"
                    },
                    {
                        "name": "吉隆"
                    },
                    {
                        "name": "聂拉木"
                    },
                    {
                        "name": "萨嘎"
                    },
                    {
                        "name": "岗巴"
                    }
                ],
                "name": "日喀则"
            },
            {
                "sub": [
                    {
                        "name": "双湖"
                    },
                    {
                        "name": "那曲"
                    },
                    {
                        "name": "嘉黎"
                    },
                    {
                        "name": "比如"
                    },
                    {
                        "name": "聂荣"
                    },
                    {
                        "name": "安多"
                    },
                    {
                        "name": "申扎"
                    },
                    {
                        "name": "索县"
                    },
                    {
                        "name": "班戈"
                    },
                    {
                        "name": "巴青"
                    },
                    {
                        "name": "尼玛"
                    }
                ],
                "name": "那曲"
            },
            {
                "sub": [
                    {
                        "name": "普兰"
                    },
                    {
                        "name": "札达"
                    },
                    {
                        "name": "噶尔"
                    },
                    {
                        "name": "日土"
                    },
                    {
                        "name": "革吉"
                    },
                    {
                        "name": "改则"
                    },
                    {
                        "name": "措勤"
                    }
                ],
                "name": "阿里"
            },
            {
                "sub": [
                    {
                        "name": "巴宜"
                    },
                    {
                        "name": "工布江达"
                    },
                    {
                        "name": "米林"
                    },
                    {
                        "name": "墨脱"
                    },
                    {
                        "name": "波密"
                    },
                    {
                        "name": "察隅"
                    },
                    {
                        "name": "朗县"
                    }
                ],
                "name": "林芝"
            }
        ],
        "name": "西藏"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "新城"
                    },
                    {
                        "name": "碑林"
                    },
                    {
                        "name": "莲湖"
                    },
                    {
                        "name": "灞桥"
                    },
                    {
                        "name": "未央"
                    },
                    {
                        "name": "雁塔"
                    },
                    {
                        "name": "阎良"
                    },
                    {
                        "name": "临潼"
                    },
                    {
                        "name": "长安"
                    },
                    {
                        "name": "蓝田"
                    },
                    {
                        "name": "周至"
                    },
                    {
                        "name": "鄠邑"
                    },
                    {
                        "name": "高陵"
                    }
                ],
                "name": "西安"
            },
            {
                "sub": [
                    {
                        "name": "王益"
                    },
                    {
                        "name": "印台"
                    },
                    {
                        "name": "耀州"
                    },
                    {
                        "name": "宜君"
                    }
                ],
                "name": "铜川"
            },
            {
                "sub": [
                    {
                        "name": "渭滨"
                    },
                    {
                        "name": "金台"
                    },
                    {
                        "name": "陈仓"
                    },
                    {
                        "name": "凤翔"
                    },
                    {
                        "name": "岐山"
                    },
                    {
                        "name": "扶风"
                    },
                    {
                        "name": "眉县"
                    },
                    {
                        "name": "陇县"
                    },
                    {
                        "name": "千阳"
                    },
                    {
                        "name": "麟游"
                    },
                    {
                        "name": "凤县"
                    },
                    {
                        "name": "太白"
                    }
                ],
                "name": "宝鸡"
            },
            {
                "sub": [
                    {
                        "name": "秦都"
                    },
                    {
                        "name": "杨陵"
                    },
                    {
                        "name": "渭城"
                    },
                    {
                        "name": "三原"
                    },
                    {
                        "name": "泾阳"
                    },
                    {
                        "name": "乾县"
                    },
                    {
                        "name": "礼泉"
                    },
                    {
                        "name": "永寿"
                    },
                    {
                        "name": "彬县"
                    },
                    {
                        "name": "长武"
                    },
                    {
                        "name": "旬邑"
                    },
                    {
                        "name": "淳化"
                    },
                    {
                        "name": "武功"
                    },
                    {
                        "name": "兴平"
                    }
                ],
                "name": "咸阳"
            },
            {
                "sub": [
                    {
                        "name": "临渭"
                    },
                    {
                        "name": "华州"
                    },
                    {
                        "name": "潼关"
                    },
                    {
                        "name": "大荔"
                    },
                    {
                        "name": "合阳"
                    },
                    {
                        "name": "澄城"
                    },
                    {
                        "name": "蒲城"
                    },
                    {
                        "name": "白水"
                    },
                    {
                        "name": "富平"
                    },
                    {
                        "name": "韩城"
                    },
                    {
                        "name": "华阴"
                    }
                ],
                "name": "渭南"
            },
            {
                "sub": [
                    {
                        "name": "宝塔"
                    },
                    {
                        "name": "延长"
                    },
                    {
                        "name": "延川"
                    },
                    {
                        "name": "子长"
                    },
                    {
                        "name": "安塞"
                    },
                    {
                        "name": "志丹"
                    },
                    {
                        "name": "吴起"
                    },
                    {
                        "name": "甘泉"
                    },
                    {
                        "name": "富县"
                    },
                    {
                        "name": "洛川"
                    },
                    {
                        "name": "宜川"
                    },
                    {
                        "name": "黄龙"
                    },
                    {
                        "name": "黄陵"
                    }
                ],
                "name": "延安"
            },
            {
                "sub": [
                    {
                        "name": "汉台"
                    },
                    {
                        "name": "南郑"
                    },
                    {
                        "name": "城固"
                    },
                    {
                        "name": "洋县"
                    },
                    {
                        "name": "西乡"
                    },
                    {
                        "name": "勉县"
                    },
                    {
                        "name": "宁强"
                    },
                    {
                        "name": "略阳"
                    },
                    {
                        "name": "镇巴"
                    },
                    {
                        "name": "留坝"
                    },
                    {
                        "name": "佛坪"
                    }
                ],
                "name": "汉中"
            },
            {
                "sub": [
                    {
                        "name": "榆阳"
                    },
                    {
                        "name": "神木"
                    },
                    {
                        "name": "府谷"
                    },
                    {
                        "name": "横山"
                    },
                    {
                        "name": "靖边"
                    },
                    {
                        "name": "定边"
                    },
                    {
                        "name": "绥德"
                    },
                    {
                        "name": "米脂"
                    },
                    {
                        "name": "佳县"
                    },
                    {
                        "name": "吴堡"
                    },
                    {
                        "name": "清涧"
                    },
                    {
                        "name": "子洲"
                    }
                ],
                "name": "榆林"
            },
            {
                "sub": [
                    {
                        "name": "汉滨"
                    },
                    {
                        "name": "汉阴"
                    },
                    {
                        "name": "石泉"
                    },
                    {
                        "name": "宁陕"
                    },
                    {
                        "name": "紫阳"
                    },
                    {
                        "name": "岚皋"
                    },
                    {
                        "name": "平利"
                    },
                    {
                        "name": "镇坪"
                    },
                    {
                        "name": "旬阳"
                    },
                    {
                        "name": "白河"
                    }
                ],
                "name": "安康"
            },
            {
                "sub": [
                    {
                        "name": "商州"
                    },
                    {
                        "name": "洛南"
                    },
                    {
                        "name": "丹凤"
                    },
                    {
                        "name": "商南"
                    },
                    {
                        "name": "山阳"
                    },
                    {
                        "name": "镇安"
                    },
                    {
                        "name": "柞水"
                    }
                ],
                "name": "商洛"
            }
        ],
        "name": "陕西"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "城关"
                    },
                    {
                        "name": "七里河"
                    },
                    {
                        "name": "西固"
                    },
                    {
                        "name": "安宁"
                    },
                    {
                        "name": "红古"
                    },
                    {
                        "name": "永登"
                    },
                    {
                        "name": "皋兰"
                    },
                    {
                        "name": "榆中"
                    }
                ],
                "name": "兰州"
            },
            {
                "sub": [
                    {
                        "name": "镜铁"
                    },
                    {
                        "name": "长城"
                    },
                    {
                        "name": "雄关"
                    }
                ],
                "name": "嘉峪关"
            },
            {
                "sub": [
                    {
                        "name": "金川"
                    },
                    {
                        "name": "永昌"
                    }
                ],
                "name": "金昌"
            },
            {
                "sub": [
                    {
                        "name": "白银"
                    },
                    {
                        "name": "平川"
                    },
                    {
                        "name": "靖远"
                    },
                    {
                        "name": "会宁"
                    },
                    {
                        "name": "景泰"
                    }
                ],
                "name": "白银"
            },
            {
                "sub": [
                    {
                        "name": "秦州"
                    },
                    {
                        "name": "麦积"
                    },
                    {
                        "name": "清水"
                    },
                    {
                        "name": "秦安"
                    },
                    {
                        "name": "甘谷"
                    },
                    {
                        "name": "武山"
                    },
                    {
                        "name": "张家川"
                    }
                ],
                "name": "天水"
            },
            {
                "sub": [
                    {
                        "name": "凉州"
                    },
                    {
                        "name": "民勤"
                    },
                    {
                        "name": "古浪"
                    },
                    {
                        "name": "天祝"
                    }
                ],
                "name": "武威"
            },
            {
                "sub": [
                    {
                        "name": "甘州"
                    },
                    {
                        "name": "肃南"
                    },
                    {
                        "name": "民乐"
                    },
                    {
                        "name": "临泽"
                    },
                    {
                        "name": "高台"
                    },
                    {
                        "name": "山丹"
                    }
                ],
                "name": "张掖"
            },
            {
                "sub": [
                    {
                        "name": "崆峒"
                    },
                    {
                        "name": "泾川"
                    },
                    {
                        "name": "灵台"
                    },
                    {
                        "name": "崇信"
                    },
                    {
                        "name": "华亭"
                    },
                    {
                        "name": "庄浪"
                    },
                    {
                        "name": "静宁"
                    }
                ],
                "name": "平凉"
            },
            {
                "sub": [
                    {
                        "name": "肃州"
                    },
                    {
                        "name": "金塔"
                    },
                    {
                        "name": "瓜州"
                    },
                    {
                        "name": "肃北"
                    },
                    {
                        "name": "阿克塞"
                    },
                    {
                        "name": "玉门"
                    },
                    {
                        "name": "敦煌"
                    }
                ],
                "name": "酒泉"
            },
            {
                "sub": [
                    {
                        "name": "西峰"
                    },
                    {
                        "name": "庆城"
                    },
                    {
                        "name": "环县"
                    },
                    {
                        "name": "华池"
                    },
                    {
                        "name": "合水"
                    },
                    {
                        "name": "正宁"
                    },
                    {
                        "name": "宁县"
                    },
                    {
                        "name": "镇原"
                    }
                ],
                "name": "庆阳"
            },
            {
                "sub": [
                    {
                        "name": "安定"
                    },
                    {
                        "name": "通渭"
                    },
                    {
                        "name": "陇西"
                    },
                    {
                        "name": "渭源"
                    },
                    {
                        "name": "临洮"
                    },
                    {
                        "name": "漳县"
                    },
                    {
                        "name": "岷县"
                    }
                ],
                "name": "定西"
            },
            {
                "sub": [
                    {
                        "name": "武都"
                    },
                    {
                        "name": "成县"
                    },
                    {
                        "name": "文县"
                    },
                    {
                        "name": "宕昌"
                    },
                    {
                        "name": "康县"
                    },
                    {
                        "name": "西和"
                    },
                    {
                        "name": "礼县"
                    },
                    {
                        "name": "徽县"
                    },
                    {
                        "name": "两当"
                    }
                ],
                "name": "陇南"
            },
            {
                "sub": [
                    {
                        "name": "临夏"
                    },
                    {
                        "name": "临夏"
                    },
                    {
                        "name": "康乐"
                    },
                    {
                        "name": "永靖"
                    },
                    {
                        "name": "广河"
                    },
                    {
                        "name": "和政"
                    },
                    {
                        "name": "东乡族"
                    },
                    {
                        "name": "积石山"
                    }
                ],
                "name": "临夏"
            },
            {
                "sub": [
                    {
                        "name": "合作"
                    },
                    {
                        "name": "临潭"
                    },
                    {
                        "name": "卓尼"
                    },
                    {
                        "name": "舟曲"
                    },
                    {
                        "name": "迭部"
                    },
                    {
                        "name": "玛曲"
                    },
                    {
                        "name": "碌曲"
                    },
                    {
                        "name": "夏河"
                    }
                ],
                "name": "甘南"
            }
        ],
        "name": "甘肃"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "城东"
                    },
                    {
                        "name": "城中"
                    },
                    {
                        "name": "城西"
                    },
                    {
                        "name": "城北"
                    },
                    {
                        "name": "大通"
                    },
                    {
                        "name": "湟中"
                    },
                    {
                        "name": "湟源"
                    }
                ],
                "name": "西宁"
            },
            {
                "sub": [
                    {
                        "name": "乐都"
                    },
                    {
                        "name": "平安"
                    },
                    {
                        "name": "民和"
                    },
                    {
                        "name": "互助"
                    },
                    {
                        "name": "化隆"
                    },
                    {
                        "name": "循化"
                    }
                ],
                "name": "海东"
            },
            {
                "sub": [
                    {
                        "name": "门源"
                    },
                    {
                        "name": "祁连"
                    },
                    {
                        "name": "海晏"
                    },
                    {
                        "name": "刚察"
                    }
                ],
                "name": "海北"
            },
            {
                "sub": [
                    {
                        "name": "同仁"
                    },
                    {
                        "name": "尖扎"
                    },
                    {
                        "name": "泽库"
                    },
                    {
                        "name": "河南"
                    }
                ],
                "name": "黄南"
            },
            {
                "sub": [
                    {
                        "name": "共和"
                    },
                    {
                        "name": "同德"
                    },
                    {
                        "name": "贵德"
                    },
                    {
                        "name": "兴海"
                    },
                    {
                        "name": "贵南"
                    }
                ],
                "name": "海南"
            },
            {
                "sub": [
                    {
                        "name": "玛沁"
                    },
                    {
                        "name": "班玛"
                    },
                    {
                        "name": "甘德"
                    },
                    {
                        "name": "达日"
                    },
                    {
                        "name": "久治"
                    },
                    {
                        "name": "玛多"
                    }
                ],
                "name": "果洛"
            },
            {
                "sub": [
                    {
                        "name": "玉树"
                    },
                    {
                        "name": "杂多"
                    },
                    {
                        "name": "治多"
                    },
                    {
                        "name": "囊谦"
                    },
                    {
                        "name": "曲麻莱"
                    }
                ],
                "name": "玉树"
            },
            {
                "sub": [
                    {
                        "name": "大柴旦"
                    },
                    {
                        "name": "冷湖"
                    },
                    {
                        "name": "茫崖"
                    },
                    {
                        "name": "格尔木"
                    },
                    {
                        "name": "德令哈"
                    },
                    {
                        "name": "乌兰"
                    },
                    {
                        "name": "都兰"
                    },
                    {
                        "name": "天峻"
                    }
                ],
                "name": "海西"
            }
        ],
        "name": "青海"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "兴庆"
                    },
                    {
                        "name": "西夏"
                    },
                    {
                        "name": "金凤"
                    },
                    {
                        "name": "永宁"
                    },
                    {
                        "name": "贺兰"
                    },
                    {
                        "name": "灵武"
                    }
                ],
                "name": "银川"
            },
            {
                "sub": [
                    {
                        "name": "大武口"
                    },
                    {
                        "name": "惠农"
                    },
                    {
                        "name": "平罗"
                    }
                ],
                "name": "石嘴山"
            },
            {
                "sub": [
                    {
                        "name": "红寺堡"
                    },
                    {
                        "name": "利通"
                    },
                    {
                        "name": "盐池"
                    },
                    {
                        "name": "同心"
                    },
                    {
                        "name": "青铜峡"
                    }
                ],
                "name": "吴忠"
            },
            {
                "sub": [
                    {
                        "name": "原州"
                    },
                    {
                        "name": "西吉"
                    },
                    {
                        "name": "隆德"
                    },
                    {
                        "name": "泾源"
                    },
                    {
                        "name": "彭阳"
                    }
                ],
                "name": "固原"
            },
            {
                "sub": [
                    {
                        "name": "沙坡头"
                    },
                    {
                        "name": "中宁"
                    },
                    {
                        "name": "海原"
                    }
                ],
                "name": "中卫"
            }
        ],
        "name": "宁夏"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "天山"
                    },
                    {
                        "name": "沙依巴克"
                    },
                    {
                        "name": "新市"
                    },
                    {
                        "name": "水磨沟"
                    },
                    {
                        "name": "头屯河"
                    },
                    {
                        "name": "达坂城"
                    },
                    {
                        "name": "米东"
                    },
                    {
                        "name": "乌鲁木齐"
                    }
                ],
                "name": "乌鲁木齐"
            },
            {
                "sub": [
                    {
                        "name": "独山子"
                    },
                    {
                        "name": "克拉玛依"
                    },
                    {
                        "name": "白碱滩"
                    },
                    {
                        "name": "乌尔禾"
                    }
                ],
                "name": "克拉玛依"
            },
            {
                "sub": [
                    {
                        "name": "高昌"
                    },
                    {
                        "name": "鄯善"
                    },
                    {
                        "name": "托克逊"
                    }
                ],
                "name": "吐鲁番"
            },
            {
                "sub": [
                    {
                        "name": "伊州"
                    },
                    {
                        "name": "巴里坤"
                    },
                    {
                        "name": "伊吾"
                    }
                ],
                "name": "哈密"
            },
            {
                "sub": [
                    {
                        "name": "昌吉"
                    },
                    {
                        "name": "阜康"
                    },
                    {
                        "name": "呼图壁"
                    },
                    {
                        "name": "玛纳斯"
                    },
                    {
                        "name": "奇台"
                    },
                    {
                        "name": "吉木萨尔"
                    },
                    {
                        "name": "木垒"
                    }
                ],
                "name": "昌吉"
            },
            {
                "sub": [
                    {
                        "name": "阿拉山口"
                    },
                    {
                        "name": "博乐"
                    },
                    {
                        "name": "精河"
                    },
                    {
                        "name": "温泉"
                    }
                ],
                "name": "博尔塔拉"
            },
            {
                "sub": [
                    {
                        "name": "库尔勒"
                    },
                    {
                        "name": "轮台"
                    },
                    {
                        "name": "尉犁"
                    },
                    {
                        "name": "若羌"
                    },
                    {
                        "name": "且末"
                    },
                    {
                        "name": "焉耆"
                    },
                    {
                        "name": "和静"
                    },
                    {
                        "name": "和硕"
                    },
                    {
                        "name": "博湖"
                    }
                ],
                "name": "巴音郭楞"
            },
            {
                "sub": [
                    {
                        "name": "阿克苏"
                    },
                    {
                        "name": "温宿"
                    },
                    {
                        "name": "库车"
                    },
                    {
                        "name": "沙雅"
                    },
                    {
                        "name": "新和"
                    },
                    {
                        "name": "拜城"
                    },
                    {
                        "name": "乌什"
                    },
                    {
                        "name": "阿瓦提"
                    },
                    {
                        "name": "柯坪"
                    }
                ],
                "name": "阿克苏"
            },
            {
                "sub": [
                    {
                        "name": "阿图什"
                    },
                    {
                        "name": "阿克陶"
                    },
                    {
                        "name": "阿合奇"
                    },
                    {
                        "name": "乌恰"
                    }
                ],
                "name": "克孜勒苏"
            },
            {
                "sub": [
                    {
                        "name": "喀什"
                    },
                    {
                        "name": "疏附"
                    },
                    {
                        "name": "疏勒"
                    },
                    {
                        "name": "英吉沙"
                    },
                    {
                        "name": "泽普"
                    },
                    {
                        "name": "莎车"
                    },
                    {
                        "name": "叶城"
                    },
                    {
                        "name": "麦盖提"
                    },
                    {
                        "name": "岳普湖"
                    },
                    {
                        "name": "伽师"
                    },
                    {
                        "name": "巴楚"
                    },
                    {
                        "name": "塔什库尔干"
                    }
                ],
                "name": "喀什"
            },
            {
                "sub": [
                    {
                        "name": "和田"
                    },
                    {
                        "name": "和田"
                    },
                    {
                        "name": "墨玉"
                    },
                    {
                        "name": "皮山"
                    },
                    {
                        "name": "洛浦"
                    },
                    {
                        "name": "策勒"
                    },
                    {
                        "name": "于田"
                    },
                    {
                        "name": "民丰"
                    }
                ],
                "name": "和田"
            },
            {
                "sub": [
                    {
                        "name": "伊宁"
                    },
                    {
                        "name": "奎屯"
                    },
                    {
                        "name": "伊宁"
                    },
                    {
                        "name": "察布查尔锡伯"
                    },
                    {
                        "name": "霍城"
                    },
                    {
                        "name": "巩留"
                    },
                    {
                        "name": "新源"
                    },
                    {
                        "name": "昭苏"
                    },
                    {
                        "name": "特克斯"
                    },
                    {
                        "name": "尼勒克"
                    },
                    {
                        "name": "霍尔果斯"
                    }
                ],
                "name": "伊犁"
            },
            {
                "sub": [
                    {
                        "name": "塔城"
                    },
                    {
                        "name": "乌苏"
                    },
                    {
                        "name": "额敏"
                    },
                    {
                        "name": "沙湾"
                    },
                    {
                        "name": "托里"
                    },
                    {
                        "name": "裕民"
                    },
                    {
                        "name": "和布克赛尔"
                    }
                ],
                "name": "塔城"
            },
            {
                "sub": [
                    {
                        "name": "阿勒泰"
                    },
                    {
                        "name": "布尔津"
                    },
                    {
                        "name": "富蕴"
                    },
                    {
                        "name": "福海"
                    },
                    {
                        "name": "哈巴河"
                    },
                    {
                        "name": "青河"
                    },
                    {
                        "name": "吉木乃"
                    }
                ],
                "name": "阿勒泰"
            },
            {
                "name": "石河子"
            },
            {
                "name": "阿拉尔"
            },
            {
                "name": "图木舒克"
            },
            {
                "name": "五家渠"
            },
            {
                "name": "北屯"
            },
            {
                "name": "铁门关"
            },
            {
                "name": "双河"
            },
            {
                "name": "可克达拉"
            },
            {
                "name": "昆玉"
            }
        ],
        "name": "新疆"
    },
    {
        "sub": [
            {
                "sub": [
                    {
                        "name": "松山"
                    },
                    {
                        "name": "信义"
                    },
                    {
                        "name": "大安"
                    },
                    {
                        "name": "中山"
                    },
                    {
                        "name": "中正"
                    },
                    {
                        "name": "大同"
                    },
                    {
                        "name": "万华"
                    },
                    {
                        "name": "文山"
                    },
                    {
                        "name": "南港"
                    },
                    {
                        "name": "内湖"
                    },
                    {
                        "name": "士林"
                    },
                    {
                        "name": "北投"
                    }
                ],
                "name": "台北"
            },
            {
                "sub": [
                    {
                        "name": "盐埕"
                    },
                    {
                        "name": "鼓山"
                    },
                    {
                        "name": "左营"
                    },
                    {
                        "name": "楠梓"
                    },
                    {
                        "name": "三民"
                    },
                    {
                        "name": "新兴"
                    },
                    {
                        "name": "前金"
                    },
                    {
                        "name": "苓雅"
                    },
                    {
                        "name": "前镇"
                    },
                    {
                        "name": "旗津"
                    },
                    {
                        "name": "小港"
                    }
                ],
                "name": "高雄"
            },
            {
                "sub": [
                    {
                        "name": "中正"
                    },
                    {
                        "name": "七堵"
                    },
                    {
                        "name": "暖暖"
                    },
                    {
                        "name": "仁爱"
                    },
                    {
                        "name": "中山"
                    },
                    {
                        "name": "安乐"
                    },
                    {
                        "name": "信义"
                    }
                ],
                "name": "基隆"
            },
            {
                "sub": [
                    {
                        "name": "大安"
                    },
                    {
                        "name": "神冈"
                    },
                    {
                        "name": "石冈"
                    },
                    {
                        "name": "东势"
                    },
                    {
                        "name": "新社"
                    },
                    {
                        "name": "和平"
                    },
                    {
                        "name": "大肚"
                    },
                    {
                        "name": "沙鹿"
                    },
                    {
                        "name": "龙井"
                    },
                    {
                        "name": "梧栖"
                    },
                    {
                        "name": "清水"
                    },
                    {
                        "name": "大甲"
                    },
                    {
                        "name": "外埔"
                    },
                    {
                        "name": "大雅"
                    },
                    {
                        "name": "潭子"
                    },
                    {
                        "name": "后里"
                    },
                    {
                        "name": "丰原"
                    },
                    {
                        "name": "乌日"
                    },
                    {
                        "name": "雾峰"
                    },
                    {
                        "name": "大里"
                    },
                    {
                        "name": "太平"
                    },
                    {
                        "name": "中区"
                    },
                    {
                        "name": "东区"
                    },
                    {
                        "name": "南区"
                    },
                    {
                        "name": "西区"
                    },
                    {
                        "name": "北区"
                    },
                    {
                        "name": "西屯"
                    },
                    {
                        "name": "南屯"
                    },
                    {
                        "name": "北屯"
                    }
                ],
                "name": "台中"
            },
            {
                "sub": [
                    {
                        "name": "东区"
                    },
                    {
                        "name": "南区"
                    },
                    {
                        "name": "北区"
                    },
                    {
                        "name": "安南"
                    },
                    {
                        "name": "安平"
                    },
                    {
                        "name": "中西"
                    }
                ],
                "name": "台南"
            },
            {
                "sub": [
                    {
                        "name": "东区"
                    },
                    {
                        "name": "北区"
                    },
                    {
                        "name": "香山"
                    }
                ],
                "name": "新竹"
            },
            {
                "sub": [
                    {
                        "name": "东区"
                    },
                    {
                        "name": "西区"
                    }
                ],
                "name": "嘉义"
            },
            {
                "sub": [
                    {
                        "name": "板桥"
                    },
                    {
                        "name": "瑞芳"
                    },
                    {
                        "name": "八里"
                    },
                    {
                        "name": "深坑"
                    },
                    {
                        "name": "三芝"
                    },
                    {
                        "name": "金山"
                    },
                    {
                        "name": "万里"
                    },
                    {
                        "name": "贡寮"
                    },
                    {
                        "name": "石门"
                    },
                    {
                        "name": "双溪"
                    },
                    {
                        "name": "石碇"
                    },
                    {
                        "name": "坪林"
                    },
                    {
                        "name": "乌来"
                    },
                    {
                        "name": "泰山"
                    },
                    {
                        "name": "五股"
                    },
                    {
                        "name": "莺歌"
                    },
                    {
                        "name": "中和"
                    },
                    {
                        "name": "新庄"
                    },
                    {
                        "name": "三重"
                    },
                    {
                        "name": "新店"
                    },
                    {
                        "name": "土城"
                    },
                    {
                        "name": "永和"
                    },
                    {
                        "name": "芦洲"
                    },
                    {
                        "name": "汐止"
                    },
                    {
                        "name": "树林"
                    },
                    {
                        "name": "淡水"
                    },
                    {
                        "name": "三峡"
                    },
                    {
                        "name": "林口"
                    },
                    {
                        "name": "平溪"
                    }
                ],
                "name": "新北"
            },
            {
                "sub": [
                    {
                        "name": "宜兰"
                    },
                    {
                        "name": "罗东"
                    },
                    {
                        "name": "苏澳"
                    },
                    {
                        "name": "头城"
                    },
                    {
                        "name": "礁溪"
                    },
                    {
                        "name": "壮围"
                    },
                    {
                        "name": "员山"
                    },
                    {
                        "name": "冬山"
                    },
                    {
                        "name": "五结"
                    },
                    {
                        "name": "三星"
                    },
                    {
                        "name": "大同"
                    },
                    {
                        "name": "南澳"
                    }
                ],
                "name": "宜兰"
            },
            {
                "sub": [
                    {
                        "name": "桃园"
                    },
                    {
                        "name": "中坜"
                    },
                    {
                        "name": "大溪"
                    },
                    {
                        "name": "杨梅"
                    },
                    {
                        "name": "芦竹"
                    },
                    {
                        "name": "大园"
                    },
                    {
                        "name": "龟山"
                    },
                    {
                        "name": "八德"
                    },
                    {
                        "name": "龙潭"
                    },
                    {
                        "name": "平镇"
                    },
                    {
                        "name": "新屋"
                    },
                    {
                        "name": "观音"
                    },
                    {
                        "name": "复兴"
                    }
                ],
                "name": "桃园"
            },
            {
                "sub": [
                    {
                        "name": "竹北"
                    },
                    {
                        "name": "竹东"
                    },
                    {
                        "name": "新埔"
                    },
                    {
                        "name": "关西"
                    },
                    {
                        "name": "湖口"
                    },
                    {
                        "name": "新丰"
                    },
                    {
                        "name": "芎林"
                    },
                    {
                        "name": "横山"
                    },
                    {
                        "name": "北埔"
                    },
                    {
                        "name": "宝山"
                    },
                    {
                        "name": "峨眉"
                    },
                    {
                        "name": "尖石"
                    },
                    {
                        "name": "五峰"
                    }
                ],
                "name": "新竹"
            },
            {
                "sub": [
                    {
                        "name": "苗栗"
                    },
                    {
                        "name": "苑里"
                    },
                    {
                        "name": "通霄"
                    },
                    {
                        "name": "竹南"
                    },
                    {
                        "name": "头份"
                    },
                    {
                        "name": "后龙"
                    },
                    {
                        "name": "卓兰"
                    },
                    {
                        "name": "大湖"
                    },
                    {
                        "name": "公馆"
                    },
                    {
                        "name": "铜锣"
                    },
                    {
                        "name": "南庄"
                    },
                    {
                        "name": "头屋"
                    },
                    {
                        "name": "三义"
                    },
                    {
                        "name": "西湖"
                    },
                    {
                        "name": "造桥"
                    },
                    {
                        "name": "三湾"
                    },
                    {
                        "name": "狮潭"
                    },
                    {
                        "name": "泰安"
                    }
                ],
                "name": "苗栗"
            },
            {
                "sub": [
                    {
                        "name": "彰化"
                    },
                    {
                        "name": "鹿港"
                    },
                    {
                        "name": "和美"
                    },
                    {
                        "name": "线西"
                    },
                    {
                        "name": "伸港"
                    },
                    {
                        "name": "福兴"
                    },
                    {
                        "name": "秀水"
                    },
                    {
                        "name": "花坛"
                    },
                    {
                        "name": "芬园"
                    },
                    {
                        "name": "员林"
                    },
                    {
                        "name": "溪湖"
                    },
                    {
                        "name": "田中"
                    },
                    {
                        "name": "大村"
                    },
                    {
                        "name": "埔盐"
                    },
                    {
                        "name": "埔心"
                    },
                    {
                        "name": "永靖"
                    },
                    {
                        "name": "社头"
                    },
                    {
                        "name": "二水"
                    },
                    {
                        "name": "北斗"
                    },
                    {
                        "name": "二林"
                    },
                    {
                        "name": "田尾"
                    },
                    {
                        "name": "埤头"
                    },
                    {
                        "name": "芳苑"
                    },
                    {
                        "name": "大城"
                    },
                    {
                        "name": "竹塘"
                    },
                    {
                        "name": "溪州"
                    }
                ],
                "name": "彰化"
            },
            {
                "sub": [
                    {
                        "name": "南投"
                    },
                    {
                        "name": "南投"
                    },
                    {
                        "name": "草屯"
                    },
                    {
                        "name": "竹山"
                    },
                    {
                        "name": "集集"
                    },
                    {
                        "name": "名间"
                    },
                    {
                        "name": "鹿谷"
                    },
                    {
                        "name": "中寮"
                    },
                    {
                        "name": "鱼池"
                    },
                    {
                        "name": "国姓"
                    },
                    {
                        "name": "水里"
                    },
                    {
                        "name": "信义"
                    },
                    {
                        "name": "仁爱"
                    }
                ],
                "name": "南投"
            },
            {
                "sub": [
                    {
                        "name": "斗六"
                    },
                    {
                        "name": "斗南"
                    },
                    {
                        "name": "虎尾"
                    },
                    {
                        "name": "西螺"
                    },
                    {
                        "name": "土库"
                    },
                    {
                        "name": "北港"
                    },
                    {
                        "name": "古坑"
                    },
                    {
                        "name": "大埤"
                    },
                    {
                        "name": "莿桐"
                    },
                    {
                        "name": "林内"
                    },
                    {
                        "name": "二仑"
                    },
                    {
                        "name": "仑背"
                    },
                    {
                        "name": "麦寮"
                    },
                    {
                        "name": "东势"
                    },
                    {
                        "name": "褒忠"
                    },
                    {
                        "name": "台西"
                    },
                    {
                        "name": "元长"
                    },
                    {
                        "name": "四湖"
                    },
                    {
                        "name": "口湖"
                    },
                    {
                        "name": "水林"
                    }
                ],
                "name": "云林"
            },
            {
                "sub": [
                    {
                        "name": "太保"
                    },
                    {
                        "name": "朴子"
                    },
                    {
                        "name": "布袋"
                    },
                    {
                        "name": "大林"
                    },
                    {
                        "name": "民雄"
                    },
                    {
                        "name": "溪口"
                    },
                    {
                        "name": "新港"
                    },
                    {
                        "name": "六脚"
                    },
                    {
                        "name": "东石"
                    },
                    {
                        "name": "义竹"
                    },
                    {
                        "name": "鹿草"
                    },
                    {
                        "name": "水上"
                    },
                    {
                        "name": "中埔"
                    },
                    {
                        "name": "竹崎"
                    },
                    {
                        "name": "梅山"
                    },
                    {
                        "name": "番路"
                    },
                    {
                        "name": "大埔"
                    },
                    {
                        "name": "阿里山"
                    }
                ],
                "name": "嘉义"
            },
            {
                "sub": [
                    {
                        "name": "屏东"
                    },
                    {
                        "name": "潮州"
                    },
                    {
                        "name": "东港"
                    },
                    {
                        "name": "恒春"
                    },
                    {
                        "name": "万丹"
                    },
                    {
                        "name": "长治"
                    },
                    {
                        "name": "麟洛"
                    },
                    {
                        "name": "九如"
                    },
                    {
                        "name": "里港"
                    },
                    {
                        "name": "盐埔"
                    },
                    {
                        "name": "高树"
                    },
                    {
                        "name": "万峦"
                    },
                    {
                        "name": "内埔"
                    },
                    {
                        "name": "竹田"
                    },
                    {
                        "name": "新埤"
                    },
                    {
                        "name": "枋寮"
                    },
                    {
                        "name": "新园"
                    },
                    {
                        "name": "崁顶"
                    },
                    {
                        "name": "林边"
                    },
                    {
                        "name": "南州"
                    },
                    {
                        "name": "佳冬"
                    },
                    {
                        "name": "琉球"
                    },
                    {
                        "name": "车城"
                    },
                    {
                        "name": "满州"
                    },
                    {
                        "name": "枋山"
                    },
                    {
                        "name": "三地门"
                    },
                    {
                        "name": "雾台"
                    },
                    {
                        "name": "玛家"
                    },
                    {
                        "name": "泰武"
                    },
                    {
                        "name": "来义"
                    },
                    {
                        "name": "春日"
                    },
                    {
                        "name": "狮子"
                    },
                    {
                        "name": "牡丹"
                    }
                ],
                "name": "屏东"
            },
            {
                "sub": [
                    {
                        "name": "卑南"
                    },
                    {
                        "name": "台东"
                    },
                    {
                        "name": "成功"
                    },
                    {
                        "name": "关山"
                    },
                    {
                        "name": "鹿野"
                    },
                    {
                        "name": "池上"
                    },
                    {
                        "name": "东河"
                    },
                    {
                        "name": "长滨"
                    },
                    {
                        "name": "太麻里"
                    },
                    {
                        "name": "大武"
                    },
                    {
                        "name": "绿岛"
                    },
                    {
                        "name": "海端"
                    },
                    {
                        "name": "延平"
                    },
                    {
                        "name": "金峰"
                    },
                    {
                        "name": "达仁"
                    },
                    {
                        "name": "兰屿"
                    }
                ],
                "name": "台东"
            },
            {
                "sub": [
                    {
                        "name": "花莲"
                    },
                    {
                        "name": "凤林"
                    },
                    {
                        "name": "玉里"
                    },
                    {
                        "name": "新城"
                    },
                    {
                        "name": "吉安"
                    },
                    {
                        "name": "寿丰"
                    },
                    {
                        "name": "光复"
                    },
                    {
                        "name": "丰滨"
                    },
                    {
                        "name": "瑞穗"
                    },
                    {
                        "name": "富里"
                    },
                    {
                        "name": "秀林"
                    },
                    {
                        "name": "万荣"
                    },
                    {
                        "name": "卓溪"
                    }
                ],
                "name": "花莲"
            },
            {
                "sub": [
                    {
                        "name": "马公"
                    },
                    {
                        "name": "湖西"
                    },
                    {
                        "name": "白沙"
                    },
                    {
                        "name": "西屿"
                    },
                    {
                        "name": "望安"
                    },
                    {
                        "name": "七美"
                    }
                ],
                "name": "澎湖"
            },
            {
                "name": "连江"
            },
            {
                "name": "金门"
            }
        ],
        "name": "台湾"
    },
    {
        "sub": [
            {
                "name": "中西"
            },
            {
                "name": "葵青"
            },
            {
                "name": "元朗"
            },
            {
                "name": "屯门"
            },
            {
                "name": "荃湾"
            },
            {
                "name": "西贡"
            },
            {
                "name": "沙田"
            },
            {
                "name": "大埔"
            },
            {
                "name": "北区"
            },
            {
                "name": "观塘"
            },
            {
                "name": "黄大仙"
            },
            {
                "name": "深水埗"
            },
            {
                "name": "油尖旺"
            },
            {
                "name": "九龙城"
            },
            {
                "name": "南区"
            },
            {
                "name": "东区"
            },
            {
                "name": "湾仔"
            },
            {
                "name": "离岛"
            }
        ],
        "name": "香港"
    },
    {
        "sub": [
            {
                "name": "花地玛"
            },
            {
                "name": "圣安多"
            },
            {
                "name": "大堂区"
            },
            {
                "name": "望德"
            },
            {
                "name": "风顺"
            },
            {
                "name": "嘉模"
            },
            {
                "name": "圣方济各"
            },
            {
                "name": "路氹城"
            }
        ],
        "name": "澳门"
    },
    {
        "name": "海外"
    }
];

export default selectArea;